YanqiS/stm32temp1/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/**
 * version .3.1
 * last change: add KL15 channel
 */

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <math.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdbool.h>
//#include <Device_V1.h>
#include <OLED.h>
//#include <USBPD.h>

#include <stm32g0xx_hal_fdcan.h>

////mylib
#include <EasySyslib.h>
#include <FlashAddr.h>
//#include "ModBus.h"
//#include "TCHUBv3.h"

#include "lvgl.h"
#include "lv_conf.h"
#include "E:\stm32\STM32CubeIDE_1.18.1\workspace\v4_3.0ZXD\G0B1VET6_TSTA_v4_3.0ZXD\Core\lvgl\examples\porting\lv_port_disp.h"
#include "E:\stm32\STM32CubeIDE_1.18.1\workspace\v4_3.0ZXD\G0B1VET6_TSTA_v4_3.0ZXD\Core\lvgl\examples\porting\lv_port_indev.h"
#include "E:\stm32\STM32CubeIDE_1.18.1\workspace\v4_3.0ZXD\G0B1VET6_TSTA_v4_3.0ZXD\Core\lvgl\gui_guider\gui_guider.h"
#include "E:\stm32\STM32CubeIDE_1.18.1\workspace\v4_3.0ZXD\G0B1VET6_TSTA_v4_3.0ZXD\Core\lvgl\gui_guider\events_init.h"

#include "E:\stm32\STM32CubeIDE_1.18.1\workspace\v4_3.0ZXD\G0B1VET6_TSTA_v4_3.0ZXD\Core\lvgl\gui_guider\widgets_init.h"
#include "E:\stm32\STM32CubeIDE_1.18.1\workspace\v4_3.0ZXD\G0B1VET6_TSTA_v4_3.0ZXD\Core\lvgl\custom\custom.h"

lv_ui guider_ui;

uint8_t lv_refresh_flg, lv_refresh_flg_old;

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
SPI_HandleTypeDef *Flash_SPI;
SPI_HandleTypeDef *TFT_SPI;

UART_HandleTypeDef *Serial_Num;

#define LINProfile_AH4EM		0
#define LINProfile_IP5PM		1
#define LINProfile_ZS32			0

#define PWM_ag0			550
#define PWM_ag90			1500
#define PWM_agMAX			145

#define ADC_CHANNELS 	6
#define LightSensr_Gate 	50
#define LIGHT_SENSOR_INVERT	0	// 0: keep raw mapping; 1: invert when hardware is wired opposite
uint16_t adc_buffer[ADC_CHANNELS] = { 0 };

static uint8_t NormalizeLightSensor(uint16_t raw_adc) {
	uint8_t level = (uint8_t) ((raw_adc * 255U) / 4095U);
	if (LIGHT_SENSOR_INVERT) {
		level = (uint8_t) (255U - level);
	}
	return level;
}

static uint8_t EncodeLightAlarm(uint8_t light_level) {
	if (light_level < LightSensr_Gate) {
		if (light_level < (LightSensr_Gate / 2)) {
			if (light_level < (LightSensr_Gate / 3)) {
				return 3;
			}
			return 2;
		}
		return 1;
	}
	return 0;
}

int Version_A = 4;	//Ver  A.BC
int Version_B = 0;
int Version_C = 3;	//0.08

uint16_t LIN_Data_LENGTH = 1;	//1;
uint16_t Serial_Data_LENGTH = 24;

uint16_t CAN1_2Ser_ID[32];
uint16_t CAN2_2Ser_ID[32];

#define LINProfile_IP5PM_L 0
#define LINProfile_IP5PM_H 1

/* ====================== 交接配置区（可直接改这里） ======================
 * 说明：
 * 1) 想切换功能时，只改下面宏开关，不要到处改业务代码。
 * 2) 每个功能都保留 A/B 两套逻辑（通过 #if/#else 切换）。
 */
// 开机是否跳过 Flash 验证（按你的约定：1=不跳过；0=跳过）
#define CFG_BOOT_FLASH_VERIFY_RUN        1
// 兼容旧宏名：1=执行验证；0=跳过验证
#define CFG_BOOT_FLASH_SELF_TEST_EN      CFG_BOOT_FLASH_VERIFY_RUN
// OLED 第4行显示方式（1=显示 LIN RID 22/34 次数 + 最近RID；0=显示 A1/A2）
#define CFG_OLED_SHOW_RID_FLAGS_EN       1

// Motor motion loop timing (ms)
#define MOTOR_INIT_RETRY_MS          100U
#define MOTOR_LOOP_INTERVAL_MS       10U
#define MOTOR_WAIT_POLL_MS           100U
#define MOTOR_SEND_GAP_MS            1U
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi1_rx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim7;
TIM_HandleTypeDef htim14;
TIM_HandleTypeDef htim15;
TIM_HandleTypeDef htim16;
TIM_HandleTypeDef htim17;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */

//////// ////////system level
//sys time
uint8_t Enp_YEAR, Enp_MONTH, Enp_DAY, Enp_HOUR, Enp_MINUTE, Enp_SECOND;
uint8_t EncrypKey;

uint8_t dateTimeBuffer[7];

bool SW_UP, SW_UP_pre, SW_DW, SW_DW_pre, SW_LEFT, SW_LEFT_pre, SW_RIGHT,
		SW_RIGHT_pre, SW_BUTTON, SW_BUTTON_pre;
uint8_t SW_UP_cnt = 0;
uint8_t SW_DW_cnt = 0;
uint8_t SW_LEFT_cnt = 0;
uint8_t SW_RIGHT_cnt = 0;

//W25Q64 	sector		block		page
//8M/64m	 256	x	 64		x	 256
int Sys_CNT, Sys_RunCNT, Sys_CNT1, Sys_RunCNT1;
////	DispX0,DispX1,DispY0,DispY1;

uint32_t Sys_TIM_TICK;	//1-1000ms
bool Sys_TIM_Flag;

//config
int8_t BoardID;
bool SW1_1, SW1_2, SW2_1, SW2_2;
int Mode_ID;//IO_CFG_1/2/3/4	电阻上拉，拨码开关off时高电平，on时与GND导�?�，低电�??????????????????????????????????????????????????????????????????????????????????????
bool g_moc_stability_test_mode = false; // id1=0 且 id2=0 时进入稳定性测试模式

//state
int sys_state = 0; //0 - 6; 	0 - none; 1- green	;2 - cyan(青色，天蓝）;3 - blue	;4 - yellow	;5 - purple	;6 - red
bool ERR = 0;
int Remote_state = 0;
uint8_t Web_ConnectSts;

uint8_t lvLED_Sts_TPRobot, lvLED_Sts_LIN, lvLED_Sts_CAN, lvLED_Sts_Sensor; // 0 grey,	1	green,	2	oragne,	3	red

////LIN
// === LIN1（huart1，SWS 0x22）状态 ===
uint8_t DataReceiveflag;
uint8_t DataProcess;
uint8_t ReceivePID, ReceiveID;
uint8_t FrameReceiveOverFlag;
uint8_t LinReceiveData[9];
uint8_t ReceiveData, SendCheckSum, ReceiveCheckSum;
uint8_t DtRxProcess;

// === LIN3（huart3，EBS 0x34/0x35/0x36 + 诊断 0x3C/0x3D）状态 ===
// 跟 LIN1 对称的一套，独立工作，不互相影响
uint8_t u3Lin_DataReceiveflag = 0;
uint8_t u3Lin_DataProcess = 0;
uint8_t u3Lin_ReceivePID = 0;
uint8_t u3Lin_ReceiveID = 0;
uint8_t u3Lin_FrameReceiveOverFlag = 0;
uint8_t u3Lin_ReceiveData = 0;
uint8_t u3Lin_ReceiveCheckSum = 0;

