YanqiS/stm32temp1/main.c
#define CANMsg_MNumb		32
FDCAN_TxHeaderTypeDef CAN_TxHeader[CANMsg_MNumb];
FDCAN_TxHeaderTypeDef FDCAN_TxHeader[CANMsg_MNumb];

// 添加调试用的全局变量
uint8_t DEBUG_CAN_Up = 0xFF;    // 0xFF表示未收到数据
uint8_t DEBUG_CAN_Down = 0xFF;
uint8_t DEBUG_CAN_RX_Flag = 0;  // 收到新数据标志
uint8_t DEBUG_LIN_Byte1 = 0;     // LIN打包后的Byte1
uint8_t DEBUG_LIN_Pack_Flag = 0; // 打包完成标志
uint8_t DEBUG_LIN_Checksum = 0;

uint8_t DEBUG_UART_RX_Count = 0;      // LIN1 UART 接收计数
uint8_t DEBUG_ReceiveID = 0;          // LIN1 收到的 ID
uint8_t DEBUG_ReceivePID = 0;         // LIN1 最近收到的 PID 字节
uint8_t DEBUG_LIN_Send_Count = 0;     // LIN1 发送计数
uint8_t DEBUG_DataProcess = 0;        // LIN1 DataProcess 状态
uint8_t DEBUG_CAN_104_Count = 0;      // 收到 0x104 的计数
uint16_t DEBUG_RID22_Count = 0;       // LIN1 识别到 RID 0x22 的累计次数

// === LIN3 (huart3) 专属 DEBUG 计数器 ===
uint8_t  DEBUG_LIN3_RX_Count = 0;     // LIN3 UART 接收计数
uint8_t  DEBUG_LIN3_ReceiveID = 0;    // LIN3 最近 ReceiveID
uint8_t  DEBUG_LIN3_ReceivePID = 0;   // LIN3 最近 ReceivePID
uint8_t  DEBUG_LIN3_Send_Count = 0;   // LIN3 发送计数
uint16_t DEBUG_LIN3_Error_Count = 0;  // LIN3 UART 错误累计（ORE/FE/NE/PE）
uint32_t DEBUG_LIN3_Last_Error = 0;   // LIN3 最近一次 ErrorCode
uint16_t DEBUG_RID34_Count = 0;       // LIN3 识别到 RID 0x34 的累计次数
uint16_t DEBUG_RID35_Count = 0;       // LIN3 RID 0x35 计数
uint16_t DEBUG_RID36_Count = 0;       // LIN3 RID 0x36 计数

// 默认 ~12.0V (raw = (12-3)/9.7656E-4 ≈ 9216 = 0x2400)
// 上电就给有效电压而不是 invalid，避免 master 第一时间把 EBS 标记成故障
uint16_t EBSBatVol_raw = 9216;            // 14bit raw, ~12.0V
uint8_t EBSVolSts_raw = 0;                // 2bit status, 0=No_error
uint8_t EBSBatCrntRng_raw = 0;            // 2bit status, 0=±1A range
uint8_t EBSBatIncnstncyFlag_raw = 0;      // 1bit, 0=no error
uint8_t EBSRespEr_raw = 0;                // 1bit, response error

// ====== LIN 2.1 节点诊断（NAD=0x47，对应 LDF 里 EBS 配置）======
// !!! 注意：诊断帧仅在 LIN3（huart3，EBS 所在总线）上处理 !!!
// 让 master 通过 0x3C/0x3D 诊断帧识别本节点存活，从而把 0x34/35/36 加入有效调度
#define EBS_CONFIGURED_NAD       0x47
#define LIN_NAD_BROADCAST        0x7F
#define LIN_NAD_FUNCTIONAL       0x7E

#define LIN_SID_ASSIGN_NAD       0xB0
#define LIN_SID_READ_BY_ID       0xB2
#define LIN_RBI_PRODUCT_ID       0x00

// !!! 真实 IBS 的 Supplier/Function ID 需要从车厂资料或抓诊断获取
// 抓到 master 发的 0x3C 请求后，把请求里的 Supplier/Function ID 填回下面两个宏
// 0x000F 是 Bosch 在 LIN consortium 的占位 supplier ID
#define EBS_SUPPLIER_ID          0x000F
#define EBS_FUNCTION_ID          0x9000
#define EBS_VARIANT              0x00

// 诊断状态（LIN3 专用）—— g_diag_rx_active 控制 LIN3 的 RX 路由：
//   0 = 正常 PID 分发（走 dispatch table）
//   1 = 正在接收 0x3C 的 8 字节 + 1 校验 payload，下一字节进 g_diag_rx_buf
static uint8_t g_ebs_nad = EBS_CONFIGURED_NAD;   // 当前 NAD（可被 Assign NAD 修改）
static uint8_t g_diag_rx_buf[9];                 // 接收 0x3C 的 8 字节 + 1 校验
static uint8_t g_diag_rx_cnt = 0;
static uint8_t g_diag_rx_active = 0;
static uint8_t g_diag_resp_buf[9];               // 给 0x3D 用：[0..7]数据 [8]校验
static uint8_t g_diag_resp_pending = 0;

uint16_t DEBUG_RID3C_Count = 0;       // LIN3 收到 PID 0x3C 的次数
uint16_t DEBUG_RID3D_Count = 0;       // LIN3 收到 PID 0x3D 的次数
uint16_t DEBUG_DIAG_Req_Count = 0;    // LIN3 NAD 匹配的诊断请求计数
uint16_t DEBUG_DIAG_Resp_Count = 0;   // LIN3 0x3D 实际发出响应计数

//////// ////////app level

//Motor Control
struct MotorCtrl_TypeDef MotorCtrl_M1, MotorCtrl_M2, MotorCtrl_M3, MotorCtrl_M4;
uint16_t HostID = 0x01;
uint16_t M1_ID = 0x0D1;        //D1	D2,	Y
uint16_t M2_ID = 0x0D2;        //D1	D2,	Y
uint16_t M3_ID = 0x0D3;        //D3	D4,	X
uint16_t M4_ID = 0x0D5;        //D5,	Z

uint8_t MotorInit_M1, MotorInit_M2, MotorInit_M3, MotorInit_M4;
bool MotorERR_M1, MotorERR_M2, MotorERR_M3, MotorERR_M4;

#define XmaxLimit 	600		//290
#define YmaxLimit 	600		//435

//#define RCtrl_Mode_0m1p		1

//#define DispX0 	100		////#define DispX1 	120		////#define DispY0 	100		////#define DispY1 	120		//
//uint8_t	DispX0[4],DispX1[4],DispY0[4],DispY1[4];
//int	DispX0_32b,DispX1_32b,DispY0_32b,DispY1_32b;

struct ScreenSize_TypeDef ScreenSz_1;

//web232
struct Ser2CAN_Msg_TypeDef Ser2CAN_Msg[CANMsg_MNumb];
struct SerLoCtrl_Msg_TypeDef SerLoCtrl_Msg;
struct Bench_AckInfo_TypeDef Bench_Info;

//TA531
struct TA531_env_TypeDef TA531SysEnv;
struct TA531_TimCallback_TypeDef TA531TimCallback;
struct TA531_RobotCtrl_TypeDef TA531_RC1;

struct TA531_GP_IN_TypeDef TA531_GP_IN;
struct TA531_Door_TypeDef TA531_Door;
uint8_t TSA_GP_IN_DATA[8];

uint8_t TA531_RC1_fg; // 0-Error;	1-no task;	2-command received;	3-command accomplish;
uint8_t TA531_RC1_x_ready, TA531_RC1_y_ready, TA531_RC1_z_ready;
uint8_t TA531_RC1_Ack, TA531_Lock;
uint16_t g_rc1_last_cmd_id = 0;
uint8_t g_rc1_x_mov_raw = 0;
uint8_t g_rc1_y_mov_raw = 0;

//stm32 header

FDCAN_TxHeaderTypeDef CAN_TxHeader[CANMsg_MNumb];
FDCAN_TxHeaderTypeDef FDCAN_TxHeader[CANMsg_MNumb];

FDCAN_TxHeaderTypeDef MotrCtrl_1_TxHeader, MotrCtrl_2_TxHeader,
		MotrCtrl_3_TxHeader, MotrCtrl_4_TxHeader;
FDCAN_RxHeaderTypeDef FDCAN1_RxHeader, FDCAN2_RxHeader, MotrCtrl_1_RxHeader,
		MotrCtrl_2_RxHeader, MotrCtrl_3_RxHeader;
FDCAN_FilterTypeDef FDCAN_Filter1[28], FDCAN_Filter2[28]; //
FDCAN_TxHeaderTypeDef TSA_Ack_Header, TSA1_ADC_Header, TSA2_LS_Header,
		TSA_Ack_RC_Header, TSA_GP_IN_Header, TSA_ActionDone_Header,
		TSA_XYDone_Header, TSA_XYMoveDone_Header;
FDCAN_TxHeaderTypeDef TSA_Door_Relay_Header;
uint8_t TSA_Door_Relay_DATA[8];
//communication

uint8_t CH1RxData[8], CH2RxData[8];
uint8_t CH1TxData[8], CH2TxData[8], TSA1_ADC_DATA[8], TSA2_LS_DATA[8],
		TSA_Ack_DATA[8], TSA_Ack_RC_DATA[8], TSA_ActionDone_DATA[8],
		TSA_XYDone_DATA[8], TSA_XYMoveDone_DATA[8];
uint8_t SWS_0x00_Data[9], SWS_0x02_Data[9], HOD_0x0_Data[9], EBS_0x0_Data[9],
		EBS_0x1_Data[9], EBS_0x2_Data[9], IFP_0x0_Data[9];
uint8_t SWS_0x22_Data[9]; //G3.0
bool SWS_0x00_Flag, SWS_0x02_Flag, HOD_0x0_Flag, EBS_0x0_Flag, IFP_0x0_Flag,
		SWS_0x22_Flag;
uint8_t MotrCtrl_1_DATA[8], MotrCtrl_2_DATA[8], MotrCtrl_3_DATA[8],
		MotrCtrl_4_DATA[8];

uint8_t I2CRxData[REC_LENGTH];
uint8_t u1RxData[REC_LENGTH], u2RxData[REC_LENGTH], u3RxData[REC_LENGTH],
		u4RxData[REC_LENGTH], u5RxData[REC_LENGTH], u6RxData[REC_LENGTH],
		RxData[REC_LENGTH];
uint8_t Serial_TxData[REC_LENGTH] = { 0 };
uint8_t Bench_Info_TxData[REC_LENGTH] = { 0 };

struct TA531_LIN_GW_TypeDef TA531_LIN_GW;
struct TA531_LIN_SWS_TypeDef TA531_LIN_SWS;
struct TA531_LIN_SWS_G3_TypeDef TA531_LIN_SWS_G3;

uint32_t len;

bool rxflag;
bool U1RXFlag = 0, U2RXFlag = 0, U3RXFlag = 0, U4RXFlag = 0, U5RXFlag = 0,
		U6RXFlag = 0;

