YanqiS/stm32temp1/main.c
bool TSA3_0x52_Flag = 0, TSA4_0x53_Flag = 0, TSA4_0x54_Flag = 0,
		TSA4_0x103_Flag = 0, TSA4_0x104_Flag = 0;

////////TMP1075
float temp1075_ZXD, temp1075_ZPD, temp1075_LHZCU, temp1075_RHZCU, temp1075_RZCU,
		temp1075_Bk1, temp1075_Bk2, temp1075_Bk3;
uint8_t temp1075_ZXD_i, temp1075_ZPD_i, temp1075_LHZCU_i, temp1075_RHZCU_i,
		temp1075_RZCU_i, temp1075_Bk1_i, temp1075_Bk2_i, temp1075_Bk3_i;
uint8_t temp1075_ZXD_f, temp1075_ZPD_f, temp1075_LHZCU_f, temp1075_RHZCU_f,
		temp1075_RZCU_f, temp1075_Bk1_f, temp1075_Bk2_f, temp1075_Bk3_f;
bool temper_flag;

uint32_t adc_value;
uint32_t mVoltage;

struct TA531_Door_TypeDef {
	uint8_t Door_FL;        // 左前门：0-无动作, 1-开, 2-关, 3-保持
	uint8_t Door_FR;        // 右前门
	uint8_t Door_RL;        // 左后门
	uint8_t Door_Hood;      // 引擎盖
	uint8_t Door_Trunk;     // 后备箱
	uint8_t Door_Reserve;
};

// ========== 电机保护系统 ==========
struct Motor_Protection_TypeDef {
	int16_t last_X_pos;
	int16_t last_Y_pos;
	int8_t X_direction_changes;
	int8_t Y_direction_changes;
	uint16_t stuck_counter;
	uint16_t movement_timeout;
	uint32_t last_progress_tick;
	uint8_t protection_triggered;
	uint8_t error_type;
	uint32_t total_errors;
};

struct Motor_Protection_TypeDef Motor_Protection;

#define MOTOR_PROTECTION_ENABLED        1
#define MAX_DIRECTION_CHANGES          3
#define MAX_STUCK_COUNT               8
#define MAX_MOVEMENT_TIMEOUT         100
#define MOVE_WAIT_TIMEOUT_MS        8000
#define MOVE_WAIT_TIMEOUT_INIT_MS   15000
#define POSITION_TOLERANCE             5
#define REACH_POSITION_TOLERANCE       2
#define MAX_MOVEMENT_TIMEOUT_MS (MAX_MOVEMENT_TIMEOUT * MOTOR_WAIT_POLL_MS)
// ==================================

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_CRC_Init(void);
static void MX_I2C3_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_TIM14_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM16_Init(void);
static void MX_TIM17_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM15_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
/* USER CODE BEGIN PFP */
void UART_RESET(UART_HandleTypeDef *huart);
void UART_Init(UART_HandleTypeDef *huart, uint32_t data_length);
void LIN_RESET(UART_HandleTypeDef *huart);
uint8_t Lin_CheckPID(uint8_t id);
uint8_t Lin_Checksum(uint8_t id, uint8_t data[]);
uint8_t Calc_SWS_G3_CRC8(const uint8_t *data, uint8_t len);
void Build_EBS_0x34_Data(void);
void Build_EBS_0x35_Data(void);
void Build_EBS_0x36_Data(void);
void Lin_DataProcess_loop_ebs(void);
void Lin_SendData(uint8_t *data);
void Lin_SendData_LIN3(uint8_t *data);   // LIN3 发送（huart3）
void Lin_DataProcess_loop(void);

void SPI_Stop(SPI_HandleTypeDef *hspi);
void SPI_Flash_Start(SPI_HandleTypeDef *hspi);
void SPI_TFT_Start(SPI_HandleTypeDef *hspi);

void Ser2CAN(void);
uint32_t mRead_ADC1_ch(uint8_t ch);
void Sys_tune1();
void Sys_tuneX(uint32_t fq);
void Sys_tuneShort(void);
uint32_t PWMServo_Ag2Pulse(uint32_t ag);
void PWMServo2_3_AGout(uint32_t ag);
void PWMServo2_4_AGout(uint32_t ag);
void PWMServo3_1_AGout(uint32_t ag);
void PWMServo3_2_AGout(uint32_t ag);
void MoC_Init();
void MotoCtrl_PackSend12();
//void MotoCtrl_PackSend2();
void MotoCtrl_PackSend3();
void MotoCtrl_PackSend4();
void MotoCtrl_PositionLoop(int PositionX_mm, int PositionY_mm);
bool WaitMotorToTargetWithProtection(uint32_t timeout_ms, uint16_t poll_ms,
		bool trigger_emergency);
bool MoveToTarget_LikeSetXY(uint32_t timeout_ms);
//void CAN2Ser_Config(void);
void Set_SystemReboot();
void Clamp_Position(int *x, int *y, bool allow_reset);
void Door_Control(void);
uint8_t ByteEncryp(uint8_t byteData);

void Motor_Protection_Init(void);
void Motor_Protection_Reset(void);
uint8_t Motor_Protection_Check(int16_t current_X, int16_t current_Y,
		int16_t target_X, int16_t target_Y);
void Motor_Protection_EmergencyStop(void);

/* ====================== 可交接功能函数（中文注释） ====================== */
#if CFG_BOOT_FLASH_SELF_TEST_EN
// 开机流程：执行 Flash 自检 + 读取 UID（A 版本）
static void Boot_RunFlashSelfTest_AndLoadUID(char *str_buf);
#else
// 开机流程：跳过 Flash 自检（B 版本）
static void Boot_SkipFlashSelfTest(void);
#endif
// OLED 第4行：显示 LIN RID 22/34 收包次数 + 最近RID
static void OLED_ShowRIDFlagsLine(uint8_t row, char *oled_line);
// OLED 运行页：id1==0（非 MoC）
static void OLED_UpdatePage_Id0(char *oled_line);
// OLED 运行页：id1==1（MoC）
static void OLED_UpdatePage_Id1(char *oled_line);
// LIN 工具：重启 USART1(LIN1) 的 LIN 接收
static void Lin_RearmUart1(void);
static void Lin_RearmUart3(void);                  // LIN3
// LIN 工具：处理常见 RID（22/34/35/36/3C/3D），返回 true 表示已处理
static bool Lin_HandleKnownRid(uint8_t rid);       // 兼容旧调用点 = LIN1
static bool Lin_HandleKnownRid_LIN1(uint8_t rid);  // LIN1 dispatch
static bool Lin_HandleKnownRid_LIN3(uint8_t rid);  // LIN3 dispatch
// LIN 工具：各 RID 独立处理函数（便于交接和扩展）
static void Lin_HandleRid22(void);                 // LIN1
static void Lin_HandleRid34(void);                 // LIN3
static void Lin_HandleRid35(void);                 // LIN3
static void Lin_HandleRid36(void);                 // LIN3
static void Lin_HandleRid3C(void);                 // LIN3
static void Lin_HandleRid3D(void);                 // LIN3
// LIN 工具：处理 0x3C 收完 8 字节后的诊断请求解析与响应准备（仅 LIN3）
static void Lin_ProcessDiagRequest(const uint8_t *pdu);
// LIN3 工具：从 USART3 读取本次接收字节、刷新调试
static void Lin_ReadRxDataFromUart3(void);
static void Lin_UpdateDebugOnRx_LIN3(void);
// LIN 工具：处理未知 RID 的通用流程
static void Lin_HandleUnknownRid(void);
// LIN 工具：从 USART1(LIN1) 读取本次接收字节/帧
static void Lin_ReadRxDataFromUart1(void);
// LIN 工具：更新本次接收的调试状态
static void Lin_UpdateDebugOnRx(void);
// UART 工具：按句柄重启接收（用于 huart1/2/3）
static void Uart_RearmByHandle(UART_HandleTypeDef *huart);
// MoC 工具：稳定性测试（X/Y 在 10~300 范围随机移动）
static void MoC_RunStabilityTestLoop(void);
// CAN 工具：动作完成后上报“1”（CAN1）
static void Can1_SendActionDoneAck(void);
// CAN 工具：XY 到位后上报“1”（CAN1）
static void Can1_SendXYDoneAck(void);
// CAN 工具：XYMov 执行完成后上报“1”（CAN1）
static void Can1_SendXYMoveDoneAck(void);
// RC 工具：Z_code 映射为触笔按压时长(ms)
static uint32_t RC1_ZCodeToHoldMs(uint8_t z_code);
// RC 工具：判断目标点是否在当前屏幕边界内（不做夹紧）
static bool Position_InBounds(int x, int y, bool allow_reset);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

