YanqiS/stm32temp1/main.c
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_FDCAN1_Init();
	MX_FDCAN2_Init();
	MX_I2C1_Init();
	MX_USART1_UART_Init();
	MX_CRC_Init();
	MX_I2C3_Init();
	MX_SPI1_Init();
	MX_TIM6_Init();
	MX_TIM7_Init();
	MX_TIM14_Init();
	MX_ADC1_Init();
	MX_TIM16_Init();
	MX_TIM17_Init();
	MX_TIM1_Init();
	MX_TIM15_Init();
	MX_USART3_UART_Init();
	MX_USART2_UART_Init();
	MX_TIM2_Init();
	MX_TIM3_Init();
	MX_TIM4_Init();
	/* USER CODE BEGIN 2 */

	///////use OLED for debug msg display
	HAL_Delay(300);
	OLED_Init(OLED_I2C_ch, OLED_type);
	OLED_Fill(OLED_I2C_ch, OLED_type, 0xff);
	HAL_Delay(1000);
	OLED_Fill(OLED_I2C_ch, OLED_type, 0x00);
	HAL_Delay(1000);

	HAL_FDCAN_MspInit(&hfdcan1);
	HAL_FDCAN_MspInit(&hfdcan2);

	Flash_SPI = &hspi1;
	TFT_SPI = &hspi1;

	TSA_Ack_Header.Identifier = 0x531;
	TSA_Ack_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_Ack_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA_Ack_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA_Ack_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA_Ack_Header.IdType = FDCAN_STANDARD_ID;
	TSA_Ack_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_Ack_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_Ack_Header.MessageMarker = 0;

	TSA2_LS_Header.Identifier = 0x51;
	TSA2_LS_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA2_LS_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA2_LS_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA2_LS_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA2_LS_Header.IdType = FDCAN_STANDARD_ID;
	TSA2_LS_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA2_LS_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA2_LS_Header.MessageMarker = 0;

	TSA1_ADC_Header.Identifier = 0x50;
	TSA1_ADC_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA1_ADC_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA1_ADC_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA1_ADC_Header.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	TSA1_ADC_Header.IdType = FDCAN_STANDARD_ID;
	TSA1_ADC_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA1_ADC_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA1_ADC_Header.MessageMarker = 0;

	TSA_GP_IN_Header.Identifier = 0x110;
	TSA_GP_IN_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_GP_IN_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA_GP_IN_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA_GP_IN_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA_GP_IN_Header.IdType = FDCAN_STANDARD_ID;
	TSA_GP_IN_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_GP_IN_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_GP_IN_Header.MessageMarker = 0;

	// CAN1 新增：动作完成ACK（data[0]=1）
	TSA_ActionDone_Header.Identifier = 0x532;
	TSA_ActionDone_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_ActionDone_Header.FDFormat = FDCAN_CLASSIC_CAN;
	TSA_ActionDone_Header.BitRateSwitch = FDCAN_BRS_OFF;
	TSA_ActionDone_Header.TxFrameType = FDCAN_DATA_FRAME;
	TSA_ActionDone_Header.IdType = FDCAN_STANDARD_ID;
	TSA_ActionDone_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_ActionDone_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_ActionDone_Header.MessageMarker = 0;

	// CAN1 新增：XY 到位 ACK（data[0]=1）
	TSA_XYDone_Header = TSA_ActionDone_Header;
	TSA_XYDone_Header.Identifier = 0x533;

	// CAN1 新增：XYMov 执行完成 ACK（data[0]=1）
	TSA_XYMoveDone_Header = TSA_ActionDone_Header;
	TSA_XYMoveDone_Header.Identifier = 0x534;

	// M1电机
	MotrCtrl_1_TxHeader.Identifier = M1_ID;  // ← 关键！0x0D1
	MotrCtrl_1_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_1_TxHeader.TxFrameType = FDCAN_DATA_FRAME;
	MotrCtrl_1_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_1_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_1_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;
	MotrCtrl_1_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;
	MotrCtrl_1_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_1_TxHeader.MessageMarker = 0;

	// M2电机
	MotrCtrl_2_TxHeader.Identifier = M2_ID;  // ← 关键！0x0D2
	MotrCtrl_2_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_2_TxHeader.TxFrameType = FDCAN_DATA_FRAME;
	MotrCtrl_2_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_2_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_2_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;
	MotrCtrl_2_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;
	MotrCtrl_2_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_2_TxHeader.MessageMarker = 0;

	// M3电机
	MotrCtrl_3_TxHeader.Identifier = M3_ID;  // ← 关键！0x0D3
	MotrCtrl_3_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_3_TxHeader.TxFrameType = FDCAN_DATA_FRAME;
	MotrCtrl_3_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_3_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_3_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;
	MotrCtrl_3_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;
	MotrCtrl_3_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_3_TxHeader.MessageMarker = 0;

	TSA_Door_Relay_Header.Identifier = 0x002;  // 使用与电机相同的ACK ID
	TSA_Door_Relay_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_Door_Relay_Header.FDFormat = FDCAN_CLASSIC_CAN;
	TSA_Door_Relay_Header.BitRateSwitch = FDCAN_BRS_OFF;
	TSA_Door_Relay_Header.TxFrameType = FDCAN_DATA_FRAME;
	TSA_Door_Relay_Header.IdType = FDCAN_STANDARD_ID;
	TSA_Door_Relay_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_Door_Relay_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_Door_Relay_Header.MessageMarker = 0;
////////TIM6定时器，20ms周期

	HAL_TIM_Base_Start_IT(&htim6);

////////TIM7定时器，100ms周期

