YanqiS/stm32temp1/main.c
	HAL_TIM_Base_Start_IT(&htim7);

////////TIM7定时器，1000ms周期

	HAL_TIM_Base_Start_IT(&htim14);

////////TIM16定时器，5ms周期

	HAL_TIM_Base_Start_IT(&htim16);

	////////TIM17定时器，1ms周期

	HAL_TIM_Base_Start_IT(&htim17);

	// 读取PCF8563的时间和日期
	//PCF8563_ReadDateTime(dateTimeBuffer);

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */

/////////////TempSensor
//	TMP1075_Init(temp1075_ch , TempSensor_ADDR_ZXD );
//	HAL_Delay(20);
////
	//SPI_TFT_NSS_Pin||SPI_Flash_NSS_Pin
//	SPI_Stop(Flash_SPI);
//	HAL_Delay(10);
//	SPI_TFT_Start(Flash_SPI);
//	HAL_Delay(50);
//Mode check
	bool id1, id2, id3, id4;
	id1 = HAL_GPIO_ReadPin(IO_CFG_1_GPIO_Port, IO_CFG_1_Pin);
	id2 = HAL_GPIO_ReadPin(IO_CFG_2_GPIO_Port, IO_CFG_2_Pin);
	id3 = HAL_GPIO_ReadPin(IO_CFG_3_GPIO_Port, IO_CFG_3_Pin);
	id4 = HAL_GPIO_ReadPin(IO_CFG_4_GPIO_Port, IO_CFG_4_Pin);
	g_moc_stability_test_mode = (id1 == 0) && (id2 == 0);

	Mode_ID = (id1 << 3) + (id2 << 2) + (id3 << 1) + (id4 << 0);

	HAL_Delay(2000);

	if (id1 == 0)	//id1 = 0, no RC（但 id1=0&id2=0 进入稳定性测试）
			{
		char *str = g_moc_stability_test_mode ? "MoC-T" : "FW: ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, str);
	} else			//id1 = 1,with RC
	{
		char *str = g_moc_stability_test_mode ? "MoC-T" : "MoC ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, str);
	}

	char str1[16] = { 0 };
	char str2[16] = { 0 };
	char oled_line[17] = { 0 };
	itoa(Version_A, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 0, str1);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 5, 0, ".");
	itoa(Version_B, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 6, 0, str1);
	itoa(Version_C, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 7, 0, str1);

	if (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) == 0) // DOWN键按下
			{
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold 5s Clear! ");
		Sys_tune1();

		uint8_t countdown = 5;
		bool stillPressed = true;

		// 倒计时5秒
		for (int i = 0; i < 5; i++) {
			if (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) != 0) // 松开了
					{
				stillPressed = false;
				break;
			}

			char str_count[16];
			itoa(countdown, str_count, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Countdown: ");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str_count);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 13, 2, "s  ");

			HAL_Delay(1000);
			countdown--;
		}

		if (stillPressed
				&& (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) == 0)) {
			// ⬅️ 清除Flash配置
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, "================");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Clearing Flash! ");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Please Wait...  ");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "================");

			Sys_tune1();  // ⬅️ 如果没有Sys_tune2就用Sys_tune1

			// ⬅️⬅️⬅️ 关键：先切换SPI到Flash模式
			SPI_Stop(Flash_SPI);
			HAL_Delay(10);
			SPI_Flash_Start(Flash_SPI);
			HAL_Delay(10);

			uint8_t clearData[4] = { 0xFF, 0xFF, 0xFF, 0xFF };

			// ⬅️⬅️⬅️ 重要：每次写入前都要加写使能！
			SPI_Flash_WtritEnable();
			HAL_Delay(5);
			SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispX0, sizeof(int));
			HAL_Delay(50);

			SPI_Flash_WtritEnable();
			HAL_Delay(5);
			SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispX1, sizeof(int));
			HAL_Delay(50);

			SPI_Flash_WtritEnable();
			HAL_Delay(5);
			SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispY0, sizeof(int));
			HAL_Delay(50);

			SPI_Flash_WtritEnable();
			HAL_Delay(5);
			SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispY1, sizeof(int));
			HAL_Delay(50);

			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, "================");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Config Cleared! ");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Rebooting...    ");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "================");

			Sys_tune1();
			HAL_Delay(2000);

			// ⬅️ 自动重启（不需要等松开按键）
			HAL_NVIC_SystemReset();
		} else {
			// 松开了，取消清除
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Clear Cancelled ");
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "                ");
			HAL_Delay(1000);
		}
	}

//	if(id1 == 1)	//id1 = 0, no RC
//	{
//		if(RCtrl_Mode_0m1p == 1)
//		{
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,14, 0, "%");
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "P/255 Control");
//		}
//		else
//		{
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,14, 0, "mm");
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Position Mode");
//		}
//	}

	HAL_Delay(2000);

//	str = "|cfg: ";
//	OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 0, str );
//	OLED_ShowString(OLED_I2C_ch ,OLED_type,14, 0," .");

//	HAL_UART_Transmit(&huart2, "ATP_TD_mini Ready~", strlen("ATP_TD_mini Ready~") ,0xff);
//	HAL_UART_Transmit_IT(&huart1, "Hello TA531~", strlen("Hello TA531~") );

	for (int i = 0; i < CANMsg_MNumb; i++)	//
			{
		CAN_TxHeader[i].TxFrameType = FDCAN_DATA_FRAME;
		CAN_TxHeader[i].ErrorStateIndicator = FDCAN_ESI_PASSIVE;
		CAN_TxHeader[i].IdType = FDCAN_STANDARD_ID;
		CAN_TxHeader[i].MessageMarker = 0;
		CAN_TxHeader[i].TxEventFifoControl = FDCAN_NO_TX_EVENTS;

		FDCAN_TxHeader[i].TxFrameType = FDCAN_DATA_FRAME;
		FDCAN_TxHeader[i].ErrorStateIndicator = FDCAN_ESI_PASSIVE;
		FDCAN_TxHeader[i].IdType = FDCAN_STANDARD_ID;
		FDCAN_TxHeader[i].MessageMarker = 0;
		FDCAN_TxHeader[i].TxEventFifoControl = FDCAN_NO_TX_EVENTS;

		Ser2CAN_Msg[i].DataCycle = 0xffff;
	}

//	  HAL_Delay(500);

	/* ====================== 开机 Flash 检测 A/B 版本切换 ======================
	 * A 版本（推荐调试）: 执行 Flash 读写自检 + 读取 UID
	 * B 版本（快速启动）: 跳过 Flash 自检，直接给默认 EncrypKey
	 * 只需修改 CFG_BOOT_FLASH_VERIFY_RUN 即可切换（1=不跳过，0=跳过）
	 */
#if CFG_BOOT_FLASH_VERIFY_RUN
	Boot_RunFlashSelfTest_AndLoadUID(str1);
#else
	/* B 版本：跳过 Flash 检测，适合快速上电验证 */
	Boot_SkipFlashSelfTest();
#endif
////

//// ADC
	HAL_Delay(50);
	if (HAL_ADCEx_Calibration_Start(&hadc1) != HAL_OK) {
		char *str0 = "ADC_Calib_Error! ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str0);
		// 校准失败，处理错�????????????????????????????????????????????????????????
		Error_Handler();
		while (1)
			;
	}

	MX_DMA_Init();
	HAL_Delay(20);
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*) adc_buffer, ADC_CHANNELS);

