YanqiS/stm32temp1/main.c
	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_TFT_Start(Flash_SPI);
	HAL_Delay(50);

	ST7789_Init();
	HAL_Delay(100);

	ST7789_Flush(TFT_RED);
	HAL_Delay(200);
	ST7789_Flush(TFT_GREEN);
	HAL_Delay(200);
	ST7789_Flush(TFT_BLUE);
	HAL_Delay(200);

//    Sys_tune1();	//1000

	for (int i = 10; i > 3; i--) {
//    	Sys_tuneX(i*300);
		HAL_Delay(100);
	}

	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	PWMServo2_3_AGout(0);
	PWMServo2_4_AGout(0);
	PWMServo3_1_AGout(0);
	PWMServo3_2_AGout(0);

	if ((id1 == 1) || g_moc_stability_test_mode)	//MoC 或 稳定性测试模式
			{
		MoC_Init();
	} else {
		lvLED_Sts_TPRobot = 0;
	}

//    Set_SystemReboot();

////// LIN init

	HAL_GPIO_WritePin(LIN1_EN_GPIO_Port, LIN1_EN_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(LIN2_EN_GPIO_Port, LIN2_EN_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(LIN3_EN_GPIO_Port, LIN3_EN_Pin, GPIO_PIN_SET);
	// 解除LIN收发器复位（NRES低电平有效，必须拉高）
	HAL_GPIO_WritePin(LIN1_NRES_GPIO_Port, LIN1_NRES_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(LIN2_NRES_GPIO_Port, LIN2_NRES_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(LIN3_NRES_GPIO_Port, LIN3_NRES_Pin, GPIO_PIN_SET);
	HAL_Delay(2);

// 启动LIN接收（放在 EN/NRES 之后，避免收发器还在 reset 时丢首帧）
	HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
	HAL_UART_Receive_IT(&huart2, u2RxData, LIN_Data_LENGTH);
	HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);

//	////Init XL9555
//	XL9555_Init( XL9555_1_addr_write , 1 , 1 );	//in in //out out
//	XL9555_Init( XL9555_2_addr_write , 1 , 1 );	//in in //out out

///////////lvgl Init
	lv_init();

	lv_port_disp_init();
	lv_port_indev_init();

	////// use gui_guider
	setup_ui(&guider_ui);
	events_init(&guider_ui);

	itoa(Version_A, str1, 10);
	lv_label_set_text(guider_ui.screen_label_A, str1);
	itoa(Version_B, str1, 10);
	lv_label_set_text(guider_ui.screen_label_B, str1);
	itoa(Version_C, str1, 10);
	lv_label_set_text(guider_ui.screen_label_C, str1);

	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_TFT_Start(Flash_SPI);
	HAL_Delay(50);

	lv_task_handler();

	Motor_Protection_Init();

	while (1) {
		Door_Control();

		if (Remote_state == 1)	//LIN simulate or real
				{
			HAL_GPIO_WritePin(LIN_RELAY_GPIO_Port, LIN_RELAY_Pin, 1);

		} else {
			HAL_GPIO_WritePin(LIN_RELAY_GPIO_Port, LIN_RELAY_Pin, 0);
		}

		Lin_DataProcess_loop();

		if (id1 == 1)	//MoC
				{
//			////
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Rds x");
//			itoa(TA531_RC1_x_ready ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,5, 1, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,6, 1, "y");
//			itoa(TA531_RC1_y_ready ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,7, 1, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 1, "z");
//			itoa(TA531_RC1_z_ready ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,9, 1, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 1, "Fg");
//			itoa(TA531_RC1_fg ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,15, 1, str1);

			if (abs(TA531_RC1.TA531_RC_X_act - TA531_RC1.TA531_RC_X_trg)
					<= REACH_POSITION_TOLERANCE) {
				TA531_RC1_x_ready = 1;
			} else {
				TA531_RC1_x_ready = 0;
			}
			if (abs(TA531_RC1.TA531_RC_Y_act - TA531_RC1.TA531_RC_Y_trg)
					<= REACH_POSITION_TOLERANCE) {
				TA531_RC1_y_ready = 1;
			} else {
				TA531_RC1_y_ready = 0;
			}

			Motor_Protection_Reset();
			Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
			Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;

			if (TA531_RC1_fg == 2) {
				bool xy_reached = WaitMotorToTargetWithProtection(
				MOVE_WAIT_TIMEOUT_INIT_MS, MOTOR_LOOP_INTERVAL_MS, true);
				TA531_RC1_x_ready = xy_reached ? 1 : 0;
				TA531_RC1_y_ready = xy_reached ? 1 : 0;
			}

			if ((TA531_RC1_x_ready == 1) & (TA531_RC1_y_ready == 1)
					& (TA531_RC1_fg < 3)) {	//reach 1st point
				bool rc_action_ready_for_reset = true;
				Can1_SendXYDoneAck();

//				itoa(TA531_RC1.TA531_RC_X_act ,str1,10);
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,6, 3, str1);
//				itoa(TA531_RC1.TA531_RC_Y_act ,str1,10);
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 3, str1);

					if (rc_action_ready_for_reset && (TA531_RC1.TA531_RC_Z_code > 0)) {
						uint32_t z_hold_ms = RC1_ZCodeToHoldMs(TA531_RC1.TA531_RC_Z_code);
						if (z_hold_ms > 0U) {
							HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);
							HAL_Delay(z_hold_ms);
						}
					}

					if ((TA531_RC1.TA531_RC_X_Mov != 0)
							| (TA531_RC1.TA531_RC_Y_Mov != 0)) {
						uint8_t id3_now = (uint8_t) HAL_GPIO_ReadPin(
						IO_CFG_3_GPIO_Port, IO_CFG_3_Pin);
						Mode_ID = (Mode_ID & 0x0D) | ((id3_now & 0x01) << 1);
						int temp_x;
						int temp_y;
						if (id3_now == 0) {
							// id3=0：XYMove 解释为“目标位置值”（相对屏幕原点），不是位移增量
							if (g_rc1_last_cmd_id == 0x065) {
								// 0x065：按与 XY 同源的百分比语义映射为目标位置
								uint8_t id4_now = (uint8_t) HAL_GPIO_ReadPin(
								IO_CFG_4_GPIO_Port, IO_CFG_4_Pin);
								uint8_t scale_den = (id4_now == 0) ? 100 : 255;
								uint8_t x_abs_raw = g_rc1_x_mov_raw;
								uint8_t y_abs_raw = g_rc1_y_mov_raw;
								if (scale_den == 100) {
									if (x_abs_raw > 100) {
										x_abs_raw = 100;
									}
									if (y_abs_raw > 100) {
										y_abs_raw = 100;
									}
								}
								temp_x = (int) (ScreenSz_1.DispX0_32b
										+ x_abs_raw
												* (ScreenSz_1.DispX1_32b
														- ScreenSz_1.DispX0_32b)
												/ scale_den);
								temp_y = (int) (ScreenSz_1.DispY0_32b
										+ y_abs_raw
												* (ScreenSz_1.DispY1_32b
														- ScreenSz_1.DispY0_32b)
												/ scale_den);
							} else {
								// 0x064：按 mm 目标位置语义（相对屏幕原点）
								temp_x = (int) (ScreenSz_1.DispX0_32b
										+ TA531_RC1.TA531_RC_X_Mov);
								temp_y = (int) (ScreenSz_1.DispY0_32b
										+ TA531_RC1.TA531_RC_Y_Mov);
							}
						} else {
							// id3=1：兼容旧逻辑，XYMove 解释为“位移增量”
								if (g_rc1_last_cmd_id == 0x065) {
									// 0x065：位移增量按 id4 选择 /100 或 /255 语义
									uint8_t id4_now = (uint8_t) HAL_GPIO_ReadPin(
									IO_CFG_4_GPIO_Port, IO_CFG_4_Pin);
									uint8_t scale_den = (id4_now == 0) ? 100 : 255;
									int x_delta_raw = (int) TA531_RC1.TA531_RC_X_Mov;
									int y_delta_raw = (int) TA531_RC1.TA531_RC_Y_Mov;
									if (scale_den == 100) {
										if (x_delta_raw > 100) {
											x_delta_raw = 100;
										} else if (x_delta_raw < -100) {
											x_delta_raw = -100;
										}
										if (y_delta_raw > 100) {
											y_delta_raw = 100;
										} else if (y_delta_raw < -100) {
											y_delta_raw = -100;
										}
									}
									temp_x = (int) (TA531_RC1.TA531_RC_X_trg
											+ x_delta_raw
												* (ScreenSz_1.DispX1_32b
														- ScreenSz_1.DispX0_32b)
												/ scale_den);
								temp_y = (int) (TA531_RC1.TA531_RC_Y_trg
										+ y_delta_raw
												* (ScreenSz_1.DispY1_32b
														- ScreenSz_1.DispY0_32b)
												/ scale_den);
							} else {
								temp_x = (int) (TA531_RC1.TA531_RC_X_trg
										+ TA531_RC1.TA531_RC_X_Mov);
								temp_y = (int) (TA531_RC1.TA531_RC_Y_trg
										+ TA531_RC1.TA531_RC_Y_Mov);
							}
						}
							if (!Position_InBounds(temp_x, temp_y, false)) {
								// 越界命令：不执行，蜂鸣提示
								Sys_tuneShort();
								rc_action_ready_for_reset = false;
							} else {
								TA531_RC1.TA531_RC_X_trg = temp_x;
								TA531_RC1.TA531_RC_Y_trg = temp_y;
								MotoCtrl_PositionLoop(temp_x, temp_y);
								rc_action_ready_for_reset = WaitMotorToTargetWithProtection(
										MOVE_WAIT_TIMEOUT_INIT_MS, MOTOR_WAIT_POLL_MS, true);
								if (rc_action_ready_for_reset) {
									Can1_SendXYMoveDoneAck();
								}
							}
					}

					if (TA531_RC1.TA531_RC_Z_code > 0) {
						HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);
						TA531_RC1.TA531_RC_Z_code2 = TA531_RC1.TA531_RC_Z_code;	// 0
						TA531_RC1.TA531_RC_X_Mov = 0;
						TA531_RC1.TA531_RC_Y_Mov = 0;
						TA531_RC1.TA531_RC_Z_code = 0;
					}

					// 固定优先级：XY -> XYMov/ZCode -> Reset（仅当前序列完成后才允许Reset）
					if ((TA531_RC1.TA531_RC_Reset == 1) && rc_action_ready_for_reset) {
						// Reset 前额外等待 2 秒，便于现场确认是否已到位
						HAL_Delay(2000);
						Motor_Protection_Reset();  // ← 新增
						Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act; // ← 新增
						Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act; // ← 新增

