YanqiS/stm32temp1/main.c
				HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port, COM_RELAY_1_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[1] = 1;
				TA531TimCallback.TA531_Callback_tim[1] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port, COM_RELAY_1_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[1] = 1;
				TA531TimCallback.TA531_Callback_tim[1] = Sys_TIM_TICK + 6000;
			}

			// 2			//		TA531SysEnv.TA531_env_KeyUnlock = (buf_rec[2]>>2)&0x03;
			if ((TA531SysEnv.TA531_env_KeyUnlock == 0)
					& (TA531TimCallback.TA531_Callback_flag[2] == 0)) {
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 0);//F
			} else if (TA531SysEnv.TA531_env_KeyUnlock == 3) {
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyUnlock == 1)	//1s
					{
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[2] = 1;
				TA531TimCallback.TA531_Callback_tim[2] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[2] = 1;
				TA531TimCallback.TA531_Callback_tim[2] = Sys_TIM_TICK + 6000;
			}

			// 3		//		TA531SysEnv.TA531_env_KeyRearDoor = (buf_rec[2]>>4)&0x03;
			if ((TA531SysEnv.TA531_env_KeyRearDoor == 0)
					& (TA531TimCallback.TA531_Callback_flag[3] == 0)) {
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 0);//F
			} else if (TA531SysEnv.TA531_env_KeyRearDoor == 3) {
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyRearDoor == 1)	//1s
					{
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[3] = 1;
				TA531TimCallback.TA531_Callback_tim[3] = Sys_TIM_TICK + 1500;

			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[3] = 1;
				TA531TimCallback.TA531_Callback_tim[3] = Sys_TIM_TICK + 6000;
			}

			// 4		//		TA531SysEnv.TA531_env_KeyBeep = (buf_rec[2]>>6)&0x03;

			// 5		//		TA531SysEnv.TA531_env_KeyWindow = (buf_rec[3]>>0)&0x03;

			// 6		//		TA531SysEnv.TA531_env_KeyLeftDoor = (buf_rec[3]>>2)&0x03;

			// 7		//		TA531SysEnv.TA531_env_KeyRightDoor = (buf_rec[3]>>4)&0x03;

			if (TA531SysEnv.TA531_env_Relay1 == 1)	//			A Y_RELAY_1_Pin
					{
				HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay1 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay2 == 1)	//
					{
				HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay2 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay3 == 1)	//
					{
				HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay3 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay4 == 1)	//
					{
				HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay4 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay5 == 1)	//			B
					{
				HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay5 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay6 == 1)	//			B
					{
				HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay6 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 1);
			}

			TSA_Ack_DATA[3] = 0xff;
			TSA3_0x52_Flag = 0;
		}

		if (TSA4_0x53_Flag == 1) {

			if (TA531SysEnv.TA531_env_WindowFL == 0)//			B		//无输�?????????????????????????????????????	上升	手动
					{
			} else if (TA531SysEnv.TA531_env_WindowFL == 1)	//			B
					{
			} else if (TA531SysEnv.TA531_env_WindowFL == 2) {
			} else if (TA531SysEnv.TA531_env_WindowFL == 3) {
			} else if (TA531SysEnv.TA531_env_WindowFL == 4) {
			}
			if (TA531SysEnv.TA531_env_WindowFR == 0)	//			B
					{
			} else if (TA531SysEnv.TA531_env_WindowFR == 1)	//			B
					{
			} else if (TA531SysEnv.TA531_env_WindowFR == 2) {
			} else if (TA531SysEnv.TA531_env_WindowFR == 3) {
			} else if (TA531SysEnv.TA531_env_WindowFR == 4) {
			}
			if (TA531SysEnv.TA531_env_WindowRL == 0)	//			RL DDDD
					{
			} else if (TA531SysEnv.TA531_env_WindowRL == 1)	//			RL DDDD
					{
			} else if (TA531SysEnv.TA531_env_WindowRL == 2) {
			} else if (TA531SysEnv.TA531_env_WindowRL == 3) {
			} else if (TA531SysEnv.TA531_env_WindowRL == 4) {
			}
			if (TA531SysEnv.TA531_env_WindowRR == 0)	//			RR DDDD
					{
			} else if (TA531SysEnv.TA531_env_WindowRR == 1)	//			RR DDDD
					{
			} else if (TA531SysEnv.TA531_env_WindowRR == 2) {
			} else if (TA531SysEnv.TA531_env_WindowRR == 3) {
			} else if (TA531SysEnv.TA531_env_WindowRR == 4) {
			}
			if (TA531SysEnv.TA531_env_HSD12_1 == 0)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD1_GPIO_Port,
				DOOR_RELAY_HSD1_Pin, 0);
			} else if (TA531SysEnv.TA531_env_HSD12_1 == 1)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD1_GPIO_Port,
				DOOR_RELAY_HSD1_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_HSD12_2 == 0)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD2_GPIO_Port,
				DOOR_RELAY_HSD2_Pin, 0);
			} else if (TA531SysEnv.TA531_env_HSD12_2 == 1)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD2_GPIO_Port,
				DOOR_RELAY_HSD2_Pin, 1);
			}
			// HSD3/4 对应输入信号是 HSD5_1 / HSD5_2（来自 TSA_0x053 的 bit6/bit7）
			if (TA531SysEnv.TA531_env_HSD5_1 == 0)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD3_GPIO_Port,
				DOOR_RELAY_HSD3_Pin, 0);
			} else if (TA531SysEnv.TA531_env_HSD5_1 == 1)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD3_GPIO_Port,
				DOOR_RELAY_HSD3_Pin, 1);
			}
			if (TA531SysEnv.TA531_env_HSD5_2 == 0)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD4_GPIO_Port,
				DOOR_RELAY_HSD4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_HSD5_2 == 1)	//
					{
				HAL_GPIO_WritePin(DOOR_RELAY_HSD4_GPIO_Port,
				DOOR_RELAY_HSD4_Pin, 1);
			}
			TA531_Door.Door_FL = (TA531SysEnv.TA531_env_DoorSwFL & 0x03); // 左前门
			TA531_Door.Door_FR = (TA531SysEnv.TA531_env_DoorSwFR & 0x03); // 右前门
			TA531_Door.Door_RL = (TA531SysEnv.TA531_env_DoorSwRL & 0x03); // 左后门
			TA531_Door.Door_Hood = (TA531SysEnv.TA531_env_DoorSwF & 0x03); // 前引擎盖 ← 改
			TA531_Door.Door_Trunk = (TA531SysEnv.TA531_env_DoorSwR & 0x03); // 后备箱 ← 改
			TA531_Door.Door_Reserve = (TA531SysEnv.TA531_env_DoorSwRR & 0x03);

			TSA4_0x53_Flag = 0;
			TSA_Ack_DATA[4] = 0xff;
		}

		if (TSA4_0x54_Flag == 1) {
			PWMServo2_3_AGout(TA531SysEnv.TA531_env_PWM_Ag_1);
			PWMServo2_4_AGout(TA531SysEnv.TA531_env_PWM_Ag_2);
			PWMServo3_1_AGout(TA531SysEnv.TA531_env_PWM_Ag_3);
			PWMServo3_2_AGout(TA531SysEnv.TA531_env_PWM_Ag_4);

			TSA4_0x54_Flag = 0;
			TSA_Ack_DATA[4] = 0xff;
		}
//		if (TSA4_0x104_Flag == 1)
//		{
//		    Lin_DataProcess_loop();  // ← 添加这行
//		    TSA4_0x104_Flag = 0;
//		    TSA_Ack_DATA[5] = 0xff;
//		}

