YanqiS/stm32temp1/main.c
			temper_flag = 0;
		}
		if (id1 == 1)  // MoC模式下显示
				{
			OLED_UpdatePage_Id1(oled_line);
		}
		// =======================================
	}  //while

	/* USER CODE END WHILE */

	/* USER CODE BEGIN 3 */

	/* USER CODE END 3 */
}

/* ====================== 可交接功能函数实现（中文） ======================
 * 目的：把易改需求（Flash开机策略/OLED显示策略）拆成独立函数，便于交接维护。
 */
#if CFG_BOOT_FLASH_SELF_TEST_EN
static void Boot_RunFlashSelfTest_AndLoadUID(char *str_buf) {
	uint8_t temp1[4], temp2[4];
	uint64_t UID;

	temp1[0] = 123;
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test");

	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(5);
	SPI_Flash_WtritEnable();
	HAL_Delay(5);
	SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
	HAL_Delay(5);
	SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));

	while (temp1[0] != temp2[0]) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test Err..");
		SPI_Stop(Flash_SPI);
		HAL_Delay(5);
		SPI_Flash_Start(Flash_SPI);
		HAL_Delay(5);
		SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
		HAL_Delay(5);
		SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));

		itoa(temp1[0], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_buf);
		itoa(temp1[1], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str_buf);
		itoa(temp2[0], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str_buf);
		itoa(temp2[1], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str_buf);
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test OK!");
	HAL_Delay(1000);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "UniqID:");
	HAL_Delay(1);
	UID = SPI_Flash_GUID();
	SPI_Stop(Flash_SPI);

	if ((UID == 0) | ((UID & 0xffff) == 0xffff)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, "Error! ");
		EncrypKey = 0x36;
	} else {
		itoa(UID, str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, str_buf);
		EncrypKey = UID & 0xff;
	}
	HAL_Delay(500);
}
#else
static void Boot_SkipFlashSelfTest(void) {
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Skip Flash Test ");
	EncrypKey = 0x36;
	HAL_Delay(200);
}
#endif

static void OLED_ShowRIDFlagsLine(uint8_t row, char *oled_line) {
	// 多视图轮播（避免 16 字符塞不下）
	// 每次调用 view_counter+1，每 30 次切一次（OLED 刷新约 100ms/次 ⇒ ~3秒切换）
	static uint8_t view_counter = 0;
	uint8_t view;
	view_counter++;
	view = (view_counter / 30) % 3;

	if (view == 0) {
		// LIN3 视图：R = LIN3 总收字节数（mod 1000） | 34 = RID34 计数（mod 100）
		//           L = LIN3 最近 ReceiveID
		// 如果 R 一直 0 → huart3 没收到任何字节（硬件 / 波特率 / PHY 问题）
		// 如果 R 在涨但 34 一直 0 → 收到了但不是 0x34（看 L 的值确认）
		// 如果 34 在涨 → EBS 通了，发 CAN 0x105 改电压应该生效
		snprintf(oled_line, 17, "R:%3u 34:%2u L:%02X",
				(unsigned int) (DEBUG_LIN3_RX_Count % 1000),
				(unsigned int) (DEBUG_RID34_Count % 100),
				(unsigned int) DEBUG_LIN3_ReceiveID);
	} else if (view == 1) {
		// LIN1 视图（原显示）：22 = RID22 计数 | 34 = RID34 计数 | I = LIN1 最近 RID
		snprintf(oled_line, 17, "22:%02u 34:%02u I:%02X",
				(unsigned int) (DEBUG_RID22_Count % 100),
				(unsigned int) (DEBUG_RID34_Count % 100),
				(unsigned int) DEBUG_ReceiveID);
	} else {
		// LIN3 错误视图：E=错误累计，EC=最近错误码低8位
		snprintf(oled_line, 17, "E:%3u EC:%02X",
				(unsigned int) (DEBUG_LIN3_Error_Count % 1000),
				(unsigned int) (DEBUG_LIN3_Last_Error & 0xFF));
	}
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, row, oled_line);
}

static void OLED_UpdatePage_Id0(char *oled_line) {
	snprintf(oled_line, 17, "L1:%3d L2:%3d", TA531SysEnv.TA531_env_LightA1,
			TA531SysEnv.TA531_env_LightA2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, oled_line);

	snprintf(oled_line, 17, "L3:%3d L4:%3d", TA531SysEnv.TA531_env_LightA3,
			TA531SysEnv.TA531_env_LightA4);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, oled_line);

#if CFG_OLED_SHOW_RID_FLAGS_EN
	/* A 版本：第4行显示 LIN RID 收包状态，方便联调 */
	OLED_ShowRIDFlagsLine(3, oled_line);
#else
	/* B 版本：第4行显示传统 A1/A2（不看 RID） */
	snprintf(oled_line, 17, "A1:%3d A2:%3d", TA531SysEnv.TA531_env_ADC1,
			TA531SysEnv.TA531_env_ADC2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, oled_line);
#endif
}

static void OLED_UpdatePage_Id1(char *oled_line) {
	// 行0显示“当前/设置上限(X1Y1)”：最大值使用已设置的 X1/Y1，而不是固定 XmaxLimit/YmaxLimit
	snprintf(oled_line, 17, "X%3d/%3dY%3d/%3d", TA531_RC1.TA531_RC_X_act,
			ScreenSz_1.DispX1_32b, TA531_RC1.TA531_RC_Y_act, ScreenSz_1.DispY1_32b);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, oled_line);

	snprintf(oled_line, 17, "L1:%3d L2:%3d", TA531SysEnv.TA531_env_LightA1,
			TA531SysEnv.TA531_env_LightA2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, oled_line);

	snprintf(oled_line, 17, "A1:%3d A2:%3d", TA531SysEnv.TA531_env_ADC1,
			TA531SysEnv.TA531_env_ADC2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, oled_line);

#if CFG_OLED_SHOW_RID_FLAGS_EN
	/* A 版本：第4行显示 LIN RID 收包状态，方便联调 */
	OLED_ShowRIDFlagsLine(3, oled_line);
#else
	/* B 版本：保留空白，避免遮挡 MoC 调试显示 */
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "                ");
#endif
}

static void Lin_RearmUart1(void) {
	LIN_RESET(&huart1);
	HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
}

// LIN1 (huart1) 的 RID 分发表：当前只有 0x22 (SWS)
static bool Lin_HandleKnownRid_LIN1(uint8_t rid) {
	typedef void (*LinRidHandler_t)(void);
	typedef struct {
		uint8_t rid;
		LinRidHandler_t handler;
	} LinRidDispatchItem;

	static const LinRidDispatchItem dispatch_table_lin1[] = { { 0x22,
			Lin_HandleRid22 } };

	for (uint8_t i = 0;
			i < (sizeof(dispatch_table_lin1) / sizeof(dispatch_table_lin1[0]));
			i++) {
		if (dispatch_table_lin1[i].rid == rid) {
			dispatch_table_lin1[i].handler();
			return true;
		}
	}
	return false;
}

// LIN3 (huart3) 的 RID 分发表：EBS 三个数据帧 + 诊断帧
static bool Lin_HandleKnownRid_LIN3(uint8_t rid) {
	typedef void (*LinRidHandler_t)(void);
	typedef struct {
		uint8_t rid;
		LinRidHandler_t handler;
	} LinRidDispatchItem;

	static const LinRidDispatchItem dispatch_table_lin3[] = { { 0x34,
			Lin_HandleRid34 }, { 0x35, Lin_HandleRid35 }, { 0x36,
			Lin_HandleRid36 }, { 0x3C, Lin_HandleRid3C }, { 0x3D,
			Lin_HandleRid3D } };

	for (uint8_t i = 0;
			i < (sizeof(dispatch_table_lin3) / sizeof(dispatch_table_lin3[0]));
			i++) {
		if (dispatch_table_lin3[i].rid == rid) {
			dispatch_table_lin3[i].handler();
			return true;
		}
	}
	return false;
}

// 兼容旧调用点：Lin_HandleKnownRid 默认走 LIN1 路径
static bool Lin_HandleKnownRid(uint8_t rid) {
	return Lin_HandleKnownRid_LIN1(rid);
}

// 输入: rid=0x22 (LIN1)，输出: 发送 SWS_0x22_Data；副作用: 清 SWS_0x22_Flag、重启 LIN1 接收
static void Lin_HandleRid22(void) {
	DEBUG_LIN_Send_Count++;
	Lin_SendData(SWS_0x22_Data);
	SWS_0x22_Flag = 0;
	DataProcess = 0;
	Lin_RearmUart1();
}

