YanqiS/stm32temp1/main.c
// 输入: rid=0x34 (LIN3)，输出: 发送 EBS_0x0_Data；副作用: 重启 LIN3 接收
static void Lin_HandleRid34(void) {
	DEBUG_LIN3_Send_Count++;
	DEBUG_RID34_Count++;
	Build_EBS_0x34_Data();   // 用最新 EBSBatVol_raw 等打包
	Lin_SendData_LIN3(EBS_0x0_Data);
	u3Lin_DataProcess = 0;
	Lin_RearmUart3();
}

// 输入: rid=0x35 (LIN3)，输出: 发送 EBS_0x1_Data；副作用: 重启 LIN3 接收
static void Lin_HandleRid35(void) {
	DEBUG_LIN3_Send_Count++;
	DEBUG_RID35_Count++;
	Build_EBS_0x35_Data();
	Lin_SendData_LIN3(EBS_0x1_Data);
	u3Lin_DataProcess = 0;
	Lin_RearmUart3();
}

// 输入: rid=0x36 (LIN3)，输出: 发送 EBS_0x2_Data；副作用: 重启 LIN3 接收
static void Lin_HandleRid36(void) {
	DEBUG_LIN3_Send_Count++;
	DEBUG_RID36_Count++;
	Build_EBS_0x36_Data();
	Lin_SendData_LIN3(EBS_0x2_Data);
	u3Lin_DataProcess = 0;
	Lin_RearmUart3();
}

// ====== LIN 2.1 诊断帧处理 ======
// 解析已接收完的 0x3C MasterReq payload，按需准备 0x3D 响应
// pdu[0..7] = 8 字节 PDU, pdu[8] = checksum（已校验过则不必再验，留给外层）
static void Lin_ProcessDiagRequest(const uint8_t *pdu) {
	uint8_t nad = pdu[0];
	uint8_t pci = pdu[1];
	uint8_t sid = pdu[2];

	// NAD 过滤：own NAD 或 broadcast NAD（functional 0x7E 这里不实现）
	bool nad_match = (nad == g_ebs_nad) || (nad == LIN_NAD_BROADCAST);
	if (!nad_match) {
		return;
	}

	// 只处理 Single Frame（PCI 高 4 位 == 0）
	uint8_t pci_type = (pci >> 4) & 0x0F;
	if (pci_type != 0) {
		return;  // 不处理 First Frame / Consecutive Frame（多帧诊断暂不支持）
	}

	DEBUG_DIAG_Req_Count++;

	switch (sid) {
	case LIN_SID_READ_BY_ID: {
		// 请求格式: NAD PCI=06 SID=B2 ID Sup_L Sup_H Fnc_L Fnc_H
		uint8_t rbi_id = pdu[3];
		uint16_t supplier_req = (uint16_t) pdu[4] | ((uint16_t) pdu[5] << 8);
		uint16_t function_req = (uint16_t) pdu[6] | ((uint16_t) pdu[7] << 8);

		// 0x7FFF / 0xFFFF 为通配（按 LIN 2.1 规范）
		bool sup_match = (supplier_req == 0x7FFF)
				|| (supplier_req == EBS_SUPPLIER_ID);
		bool fnc_match = (function_req == 0xFFFF)
				|| (function_req == EBS_FUNCTION_ID);
		if (!sup_match || !fnc_match) {
			return;
		}

		if (rbi_id == LIN_RBI_PRODUCT_ID) {
			// 正响应：NAD PCI=06 RSID=F2 Sup_L Sup_H Fnc_L Fnc_H Variant
			g_diag_resp_buf[0] = g_ebs_nad;
			g_diag_resp_buf[1] = 0x06;
			g_diag_resp_buf[2] = (uint8_t) (sid | 0x40);  // RSID
			g_diag_resp_buf[3] = (uint8_t) (EBS_SUPPLIER_ID & 0xFF);
			g_diag_resp_buf[4] = (uint8_t) ((EBS_SUPPLIER_ID >> 8) & 0xFF);
			g_diag_resp_buf[5] = (uint8_t) (EBS_FUNCTION_ID & 0xFF);
			g_diag_resp_buf[6] = (uint8_t) ((EBS_FUNCTION_ID >> 8) & 0xFF);
			g_diag_resp_buf[7] = EBS_VARIANT;
			g_diag_resp_pending = 1;
		}
		// 其它 RBI ID（Serial number=0x01 等）暂不实现
		break;
	}
	case LIN_SID_ASSIGN_NAD: {
		// 请求格式: 0x7F PCI=06 SID=B0 Sup_L Sup_H Fnc_L Fnc_H NewNAD
		// 只有当 Supplier/Function ID 都精确匹配时才响应
		uint16_t supplier_req = (uint16_t) pdu[3] | ((uint16_t) pdu[4] << 8);
		uint16_t function_req = (uint16_t) pdu[5] | ((uint16_t) pdu[6] << 8);
		uint8_t new_nad = pdu[7];

		if ((supplier_req == EBS_SUPPLIER_ID)
				&& (function_req == EBS_FUNCTION_ID)) {
			// 用旧 NAD 回响应，然后更新到 new NAD
			g_diag_resp_buf[0] = g_ebs_nad;
			g_diag_resp_buf[1] = 0x01;
			g_diag_resp_buf[2] = (uint8_t) (sid | 0x40);  // RSID=F0
			g_diag_resp_buf[3] = 0xFF;
			g_diag_resp_buf[4] = 0xFF;
			g_diag_resp_buf[5] = 0xFF;
			g_diag_resp_buf[6] = 0xFF;
			g_diag_resp_buf[7] = 0xFF;
			g_diag_resp_pending = 1;

			g_ebs_nad = new_nad;
		}
		break;
	}
	default:
		// 其它 SID 暂不实现（可加 negative response 0x7F 但 master 通常不需要）
		break;
	}
}

// 输入: rid=0x3C (LIN3)，副作用: 切到 diag rx 模式，接下来 9 字节进 g_diag_rx_buf
static void Lin_HandleRid3C(void) {
	DEBUG_RID3C_Count++;
	g_diag_rx_active = 1;
	g_diag_rx_cnt = 0;
	u3Lin_DataProcess = 0;
	Lin_RearmUart3();
}

// 输入: rid=0x3D (LIN3)，副作用: 若有 pending 响应就发出；否则什么都不做（让 master 超时）
static void Lin_HandleRid3D(void) {
	DEBUG_RID3D_Count++;
	if (g_diag_resp_pending) {
		// Lin_SendData_LIN3 用 u3Lin_ReceiveID 算 checksum，此时 u3Lin_ReceiveID=0x3D
		// Lin_Checksum 内部对 0x3C/0x3D 用 classic checksum（不含 PID）✓
		Lin_SendData_LIN3(g_diag_resp_buf);
		g_diag_resp_pending = 0;
		DEBUG_DIAG_Resp_Count++;
	}
	u3Lin_DataProcess = 0;
	Lin_RearmUart3();
}

// 输入: u1RxData/LIN_Data_LENGTH，输出: 更新 ReceiveData/RxData
static void Lin_ReadRxDataFromUart1(void) {
	if (LIN_Data_LENGTH == 1) {
		ReceiveData = u1RxData[0];
	} else {
		for (int i = 0; i < LIN_Data_LENGTH; i++) {
			RxData[i] = u1RxData[i];
		}
		ReceiveData = u1RxData[0];
	}
}

// 输入: ReceiveData，输出: 更新 ReceivePID/ReceiveID 和 DEBUG 统计
static void Lin_UpdateDebugOnRx(void) {
	ReceivePID = ReceiveData;
	ReceiveID = ReceivePID & 0x3f;
	DEBUG_ReceivePID = ReceivePID;

	DEBUG_UART_RX_Count++;
	DEBUG_ReceiveID = ReceiveID;
	DEBUG_DataProcess = DataProcess;
	if (ReceiveID == 0x22) {
		DEBUG_RID22_Count++;
	} else if (ReceiveID == 0x34) {
		DEBUG_RID34_Count++;
	}
}

static void Lin_HandleUnknownRid(void) {
	DataReceiveflag = 1;
	DataProcess = 2;
	Lin_RearmUart1();
}

static void Uart_RearmByHandle(UART_HandleTypeDef *huart) {
	if (huart == &huart1) {
		HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
	} else if (huart == &huart2) {
		HAL_UART_Receive_IT(&huart2, u2RxData, LIN_Data_LENGTH);
	} else if (huart == &huart3) {
		HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);
	}
}

static void Can1_SendActionDoneAck(void) {
	memset(TSA_ActionDone_DATA, 0, sizeof(TSA_ActionDone_DATA));
	TSA_ActionDone_DATA[0] = 1;
	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_ActionDone_Header,
			TSA_ActionDone_DATA);
}

static void Can1_SendXYDoneAck(void) {
	memset(TSA_XYDone_DATA, 0, sizeof(TSA_XYDone_DATA));
	TSA_XYDone_DATA[0] = 1;
	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_XYDone_Header,
			TSA_XYDone_DATA);
}

static void Can1_SendXYMoveDoneAck(void) {
	memset(TSA_XYMoveDone_DATA, 0, sizeof(TSA_XYMoveDone_DATA));
	TSA_XYMoveDone_DATA[0] = 1;
	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_XYMoveDone_Header,
			TSA_XYMoveDone_DATA);
}

static uint32_t RC1_ZCodeToHoldMs(uint8_t z_code) {
	switch (z_code & 0x03) {
	case 1:
		return 100U;   // 快速点击 0.1s
	case 2:
		return 2000U;  // 2s
	case 3:
		return 5000U;  // 5s
	default:
		return 0U;
	}
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

