YanqiS/stm32temp1/main.c
	}

	if (htim == &htim16)	//50ms
			{
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA1_ADC_Header,
				TSA1_ADC_DATA);
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA2_LS_Header, TSA2_LS_DATA);

		////for touchpen short/long time count
		Sys_TIM_TICK = Sys_TIM_TICK + 5;

		if (Sys_TIM_TICK > 0xFFFFFFF0) {
			Sys_TIM_TICK = 0;
		}
	}
	if (htim == &htim17)	//1ms
			{
		lv_tick_inc(1);
	}

}

uint8_t Lin_CheckPID(uint8_t id) {
	uint8_t returnpid;
	uint8_t P0;
	uint8_t P1;

	P0 = (((id) ^ (id >> 1) ^ (id >> 2) ^ (id >> 4)) & 0x01) << 6;
	P1 = ((~((id >> 1) ^ (id >> 3) ^ (id >> 4) ^ (id >> 5))) & 0x01) << 7;

	returnpid = id | P0 | P1;

	return returnpid;
}

uint8_t Lin_Checksum(uint8_t id, uint8_t *data) {
	uint8_t t;
	uint16_t sum = 0;
	bool is_diag_frame = (id == 0x3C) || (id == 0x3D);

	for (t = 0; t < 8; t++) {
		sum += data[t];
		if (sum & 0xff00) {
			sum = (sum & 0x00ff) + 1;
		}
	}

	if (!is_diag_frame) {
		sum += Lin_CheckPID(id);
		if (sum & 0xff00) {
			sum = (sum & 0x00ff) + 1;
		}
	}

	sum = ~sum;
	data[8] = (uint8_t) sum;
	return (uint8_t) sum;
}

uint8_t Calc_SWS_G3_CRC8(const uint8_t *data, uint8_t len) {
	uint8_t crc = 0x00;

	for (uint8_t i = 0; i < len; i++) {
		crc ^= data[i];
		for (uint8_t bit = 0; bit < 8; bit++) {
			if (crc & 0x80) {
				crc = (uint8_t) ((crc << 1) ^ 0x1D);
			} else {
				crc <<= 1;
			}
		}
	}

	return crc;
}

void Build_EBS_0x34_Data(void) {
	uint16_t v = EBSBatVol_raw & 0x3FFF;
	// EBSBatCrnt raw=0x8000 => 0x8000*0.0078125-256 = 0A (factor=0.0078125, offset=-256)
	uint16_t crnt = 0x8000;
	// EBSBatTem raw=65 => 65*1-40 = 25°C (factor=1, offset=-40)
	uint8_t tem = 65;

	memset(EBS_0x0_Data, 0, 9);

	// bit0..13: EBSBatVol_l (14bit)
	EBS_0x0_Data[0] = (uint8_t) (v & 0xFF);
	// bit8..13: EBSBatVol_l high, bit14..15: EBSBatCrntRng_l
	EBS_0x0_Data[1] = (uint8_t) (((v >> 8) & 0x3F) | ((EBSBatCrntRng_raw & 0x03) << 6));
	// bit16..31: EBSBatCrnt_l (16bit, little-endian)
	EBS_0x0_Data[2] = (uint8_t) (crnt & 0xFF);
	EBS_0x0_Data[3] = (uint8_t) ((crnt >> 8) & 0xFF);
	// bit32..39: EBSBatTem_l
	EBS_0x0_Data[4] = tem;
	// bit40..47: EBSQucntCrnt_l = 0
	EBS_0x0_Data[5] = 0;
	// bit48..49: EBSCrntSts_l=0 (No_error)
	// bit50..51: EBSVolSts_l
	// bit52..53: EBSTemSts_l=0 (No_error)
	// bit54:     EBSErInCalData_l=0
	// bit55:     EBSErInECUIdficn_l=0
	EBS_0x0_Data[6] = (uint8_t) ((EBSVolSts_raw & 0x03) << 2);
	// bit56:     EBSRespEr_l
	// bit57:     EBSBatIncnstncyFlag_l
	EBS_0x0_Data[7] = (uint8_t) ((EBSRespEr_raw & 0x01)
			| ((EBSBatIncnstncyFlag_raw & 0x01) << 1));
}

// EBS_ICCLIN1_FrP01_ICC_LIN1 (LIN ID 0x35): SOC, SOH, SOF signals
// Sends placeholder values to prevent LIN master timeout
void Build_EBS_0x35_Data(void) {
	memset(EBS_0x1_Data, 0, 9);
	// byte0: EBSSOC_l=0 (0%)
	// byte1: EBSSOHOfSlphtn_l=0
	// byte2: EBSBatSOFVol1_l=0
	// byte3: EBSBatSOFVol2_l=0
	// byte4: EBSSOHOfLAM_l=0
	// byte5: EBSSOHOfCrsn_l=0
	// byte6 bit2-3: EBSSOCSts_l=0 (deviation>15%, valid encoding)
	// byte6 bit4-5: EBSSOHOfSlphtnSts_l=0
	// byte6 bit6-7: EBSBatSOFVol1Sts_l=0
	// byte7 bit0-1: EBSBatSOFVol2Sts_l=0
	// byte7 bit2-3: EBSSOHOfLAMSts_l=0
	// byte7 bit4-5: EBSSOHOfCrsnSts_l=0
}

// EBS_ICCLIN1_FrP02_ICC_LIN1 (LIN ID 0x36): accumulated charge/discharge
// Sends placeholder values to prevent LIN master timeout
void Build_EBS_0x36_Data(void) {
	memset(EBS_0x2_Data, 0, 9);
	// byte0-1: EBSAcumtdBatChrg_l=0
	// byte2-3: EBSAcumtdBatDschrg_l=0
}

void Lin_SendData(uint8_t *data) {
	Lin_Checksum(ReceiveID, data);

	HAL_UART_Transmit_IT(&huart1, data, 9);

	lvLED_Sts_LIN = 1;
}

// ============================================================
// LIN3 (huart3) 专用：跟 LIN1 一套对称的发送 / 接收 / 重启接收
// ============================================================
void Lin_SendData_LIN3(uint8_t *data) {
	// 用 LIN3 的 ReceiveID 算 checksum（与 LIN1 的 ReceiveID 完全独立）
	Lin_Checksum(u3Lin_ReceiveID, data);

	HAL_UART_Transmit_IT(&huart3, data, 9);

	lvLED_Sts_LIN = 1;
}

static void Lin_RearmUart3(void) {
	LIN_RESET(&huart3);
	HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);
}

// 从 USART3(LIN3) 读取本次接收字节
static void Lin_ReadRxDataFromUart3(void) {
	if (LIN_Data_LENGTH == 1) {
		u3Lin_ReceiveData = u3RxData[0];
	} else {
		// 当前实现只用 1 字节模式，留个分支兜底
		u3Lin_ReceiveData = u3RxData[0];
	}
	u3Lin_ReceivePID = u3Lin_ReceiveData;
}

// 在 LIN3 ISR 里把刚收到的字节同步到 DEBUG 和 LIN3 ReceiveID
static void Lin_UpdateDebugOnRx_LIN3(void) {
	DEBUG_LIN3_RX_Count++;
	DEBUG_LIN3_ReceivePID = u3Lin_ReceivePID;
	u3Lin_ReceiveID = u3Lin_ReceivePID & 0x3F;
	DEBUG_LIN3_ReceiveID = u3Lin_ReceiveID;
}

void Lin_DataProcess_loop(void)	//asap, if need to deal with LIN data; if not ,seems no use
{
	//// ========== 直接打包 SWS_0x22_Data，无条件执行（像main1_1.c一样）==========
	SWS_0x22_Data[1] = ((TA531_LIN_SWS_G3.CCSwStsAlvRC_l & 0x0f) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelUpSwAL_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSSelDwnSwAL_l & 0x03) << 6);
	DEBUG_LIN_Byte1 = SWS_0x22_Data[1];
	DEBUG_LIN_Pack_Flag = 1;

	SWS_0x22_Data[2] = ((TA531_LIN_SWS_G3.SWSSelLSwAL_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelRSwAL_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.SWSCnfmSwAL_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSPB1SwAL_l & 0x03) << 6);

	SWS_0x22_Data[3] = ((TA531_LIN_SWS_G3.SWSPB2SwAL_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSPB3SwAL_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.SWSSelUpSwReq_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSSelDwnSwReq_l & 0x03) << 6);

	SWS_0x22_Data[4] = ((TA531_LIN_SWS_G3.SWSSelLSwReq_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelRSwReq_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.SWSCnfmSwReq_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSPB1SwReq_l & 0x03) << 6);

	SWS_0x22_Data[5] = ((TA531_LIN_SWS_G3.SWSPB2SwReq_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSPB3SwReq_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.PfTrTapUpDwnSecySwSta_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.PadSSelLSwA_l & 0x03) << 6);

	SWS_0x22_Data[6] = ((TA531_LIN_SWS_G3.PadSSelRSwA_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelLSwStuckL_l & 0x01) << 2)
			+ ((TA531_LIN_SWS_G3.SWSSelRSwStuckL_l & 0x01) << 3)
			+ ((TA531_LIN_SWS_G3.SWSCnfmSwStuckL_l & 0x01) << 4)
			+ ((TA531_LIN_SWS_G3.SWSPB1SwStuckL_l & 0x01) << 5)
			+ ((TA531_LIN_SWS_G3.SWSPB2SwStuckL_l & 0x01) << 6)
			+ ((TA531_LIN_SWS_G3.SWSPB3SwStuckL_l & 0x01) << 7);

