YanqiS/stm32temp1/main.c
	SWS_0x22_Data[7] = ((TA531_LIN_SWS_G3.StrgWhlEntrtnSwDataIntgty_l & 0x01)
			<< 0) + ((TA531_LIN_SWS_G3.StrgWhlDrvngMdSwA_l & 0x01) << 1)
			+ ((TA531_LIN_SWS_G3.StrgWhlDrvngMdSwDataIntgty_l & 0x01) << 2)
			+ ((TA531_LIN_SWS_G3.StrgWhlTipcSwDataIntgty_l & 0x01) << 3)
			+ ((TA531_LIN_SWS_G3.PadSSelLSwStuck_l & 0x01) << 4)
			+ ((TA531_LIN_SWS_G3.PadSSelRSwStuck_l & 0x01) << 5)
			+ ((TA531_LIN_SWS_G3.RespErSWSF_l & 0x01) << 6);

	SWS_0x22_Data[0] = Calc_SWS_G3_CRC8(&SWS_0x22_Data[1], 7);

	Lin_DataProcess_loop_ebs();

	//// ========== 处理接收到的LIN数据 ==========
	uint8_t PIDChecksum;
	uint8_t SumCheck;

	if (DataReceiveflag == 1) {
		ReceiveID = ReceivePID & 0x3f;
		PIDChecksum = Lin_CheckPID(ReceiveID);
		if (PIDChecksum != ReceivePID) {
			return;
		}

		if (FrameReceiveOverFlag == 1) {
			SumCheck = Lin_Checksum(ReceiveID, LinReceiveData);
			if (ReceiveCheckSum != SumCheck) {
				return;
			}

			if (ReceiveID == 0x23) {
				if (LinReceiveData[3] == 0x01) {
				} else if (LinReceiveData[3] == 0x02) {
				}
			}
		}
		FrameReceiveOverFlag = 0;
		DataReceiveflag = 0;
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	// ========== LIN1 (huart1) 路径 ==========
	if (huart == &huart1) {
		Lin_ReadRxDataFromUart1();
		Lin_UpdateDebugOnRx();

		// LIN1 上只挂了 0x22 (SWS)，没有诊断帧需要 rx 数据
		if (Lin_HandleKnownRid_LIN1(ReceiveID)) {
			return;
		}
		// 未识别 RID：进入后续通用流程
		Lin_HandleUnknownRid();
		return;
	}

	// ========== LIN3 (huart3) 路径 ==========
	if (huart == &huart3) {
		Lin_ReadRxDataFromUart3();

		// 如果正在接收 0x3C 诊断帧的 payload（8 数据 + 1 校验 共 9 字节），
		// 这些字节不走 PID 分发，直接进 g_diag_rx_buf
		if (g_diag_rx_active) {
			g_diag_rx_buf[g_diag_rx_cnt] = u3Lin_ReceiveData;
			g_diag_rx_cnt++;
			if (g_diag_rx_cnt >= 9) {
				g_diag_rx_active = 0;
				g_diag_rx_cnt = 0;
				// 收完后解析诊断请求，准备 0x3D 的响应
				Lin_ProcessDiagRequest(g_diag_rx_buf);
			}
			Lin_RearmUart3();
			return;
		}

		Lin_UpdateDebugOnRx_LIN3();

		// LIN3 dispatch：0x34/0x35/0x36/0x3C/0x3D
		if (Lin_HandleKnownRid_LIN3(u3Lin_ReceiveID)) {
			return;
		}
		// LIN3 未识别 RID：只重启接收，不走 LIN1 的 Lin_HandleUnknownRid
		// （因为 Lin_HandleUnknownRid 会动 huart1 的全局状态）
		u3Lin_DataProcess = 0;
		Lin_RearmUart3();
		return;
	}

	// 其它 UART（如 huart2）保持原行为：重启接收
	Uart_RearmByHandle(huart);
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
	// LIN break/噪声场景下，UART 可能进入错误态导致后续收包中断不再触发
	// 这里对 LIN1/LIN3 统一做“记数 + 复位接收链路 + 重新挂接收”
	if (huart == &huart1) {
		UART_RESET(&huart1);
		HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
		return;
	}

	if (huart == &huart3) {
		DEBUG_LIN3_Error_Count++;
		DEBUG_LIN3_Last_Error = huart3.ErrorCode;
		g_diag_rx_active = 0;
		g_diag_rx_cnt = 0;
		u3Lin_DataProcess = 0;
		UART_RESET(&huart3);
		HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);
		return;
	}

	UART_RESET(huart);
	Uart_RearmByHandle(huart);
}

void UART_Init(UART_HandleTypeDef *handle, uint32_t data_length) {

	if (handle == &huart1) {
		HAL_UART_Receive_IT(&huart1, u1RxData, Serial_Data_LENGTH);	//
		return;
	}
	Uart_RearmByHandle(handle);

}

void UART_RESET(UART_HandleTypeDef *handle) {

	HAL_UART_AbortReceive(handle);
	HAL_UART_AbortReceive_IT(handle);
	/* Clear RXNE interrupt flag *//* Discard the received data */
	__HAL_UART_SEND_REQ(handle, UART_RXDATA_FLUSH_REQUEST);

}
//void CAN2Ser_Config(void)
//{
//
//}

uint32_t mRead_ADC1_ch(uint8_t ch) {
	//start ADC
	HAL_ADC_Start(&hadc1);

	HAL_ADC_PollForConversion(&hadc1, 500);

	if (ch == 1) {

	} else if (ch == 2)	//```6
			{

	}

//    if (HAL_IS_BIT_SET(HAL_ADC_GetState(&hadc1), HAL_ADC_STATE_REG_EOC))//读取ADC完成标志�?????????????????????????????????????????????????????????
//    {
//        adc_value = HAL_ADC_GetValue(&hadc1);//读出ADC数�??
//
//        // 将ADC值转换为电压
//        mVoltage = adc_value  *1165 /165 * 3250/ 4095; // 12位ADC，最�?????????????????????????????????????????????????????????4095
//    }

	// 停止ADC转换
	HAL_ADC_Stop(&hadc1);

	return mVoltage;
}

bool WaitMotorToTargetWithProtection(uint32_t timeout_ms, uint16_t poll_ms,
		bool trigger_emergency) {
	uint32_t start_tick = HAL_GetTick();

	while ((abs(TA531_RC1.TA531_RC_X_act - TA531_RC1.TA531_RC_X_trg)
			> REACH_POSITION_TOLERANCE)
			|| (abs(TA531_RC1.TA531_RC_Y_act - TA531_RC1.TA531_RC_Y_trg)
					> REACH_POSITION_TOLERANCE)) {
		MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

		if (Motor_Protection_Check(TA531_RC1.TA531_RC_X_act,
				TA531_RC1.TA531_RC_Y_act, TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg) != 0) {
			if (trigger_emergency) {
				Motor_Protection_EmergencyStop();
			}
			return false;
		}

		if ((HAL_GetTick() - start_tick) > timeout_ms) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 3;
			Motor_Protection.total_errors++;
			if (trigger_emergency) {
				Motor_Protection_EmergencyStop();
			}
			return false;
		}

		HAL_Delay(poll_ms);
	}

	return true;
}

// 开机/验证后移动：统一为与 CAN 控制一致的循环节奏
bool MoveToTarget_LikeSetXY(uint32_t timeout_ms) {
	uint32_t start_tick = HAL_GetTick();

	while ((abs(TA531_RC1.TA531_RC_X_act - TA531_RC1.TA531_RC_X_trg)
			> REACH_POSITION_TOLERANCE)
			|| (abs(TA531_RC1.TA531_RC_Y_act - TA531_RC1.TA531_RC_Y_trg)
					> REACH_POSITION_TOLERANCE)) {
		MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);
		HAL_Delay(MOTOR_LOOP_INTERVAL_MS);  // 与 CAN 控制主循环一致

		if (Motor_Protection_Check(TA531_RC1.TA531_RC_X_act,
				TA531_RC1.TA531_RC_Y_act, TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg) != 0) {
			Motor_Protection_EmergencyStop();
			return false;
		}

		if ((HAL_GetTick() - start_tick) > timeout_ms) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 3;
			Motor_Protection.total_errors++;
			Motor_Protection_EmergencyStop();
			return false;
		}
	}

	return true;
}

static void MoC_RunStabilityTestLoop(void) {
	char str1[16];
	uint32_t seed = HAL_GetTick();
	const int min_x = 10;
	const int max_x = 210;
	const int min_y = 10;
	const int max_y = 300;

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Stability Test  ");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X10~210 Y10~300");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Running...      ");

	// 稳定性测试：持续随机移动，便于长时间观察运行稳定性
	while (1) {
		seed = seed * 1664525u + 1013904223u;
		TA531_RC1.TA531_RC_X_trg = min_x + (int) (seed % (max_x - min_x + 1));
		seed = seed * 1664525u + 1013904223u;
		TA531_RC1.TA531_RC_Y_trg = min_y + (int) (seed % (max_y - min_y + 1));

