YanqiS/stm32temp1/main.c
		Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);

		TA531_RC1_fg = 2;
		Motor_Protection_Reset();
		Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
		Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
		if (!MoveToTarget_LikeSetXY(MOVE_WAIT_TIMEOUT_INIT_MS)) {
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Stability Stop! ");
			return;
		}

		snprintf(str1, sizeof(str1), "X:%3d Y:%3d", TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "                ");
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str1);
		HAL_Delay(150);
	}
}

void Lin_DataProcess_loop_ebs(void) {
	// 0x34 数据现在改为在 Lin_HandleRid34() 内即时 build，与 0x35/0x36 一致
	// 此处不再预 build，避免重复也消除 1 个循环周期的数据滞后
	(void) 0;
}

void MoC_Init() {
	////42 MotorCtrl init
	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(10);
	MotorInit_M1 = 0;
	MotorInit_M2 = 0;
	MotorInit_M3 = 0;
	MotorInit_M4 = 0;

	MotorCtrl_M1.MotorCtrl_HostID = HostID;
	MotorCtrl_M1.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M1.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M1.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M1.MotorCtrl_DataCode = 0x000000;

	MotorCtrl_M2.MotorCtrl_HostID = HostID;
	MotorCtrl_M2.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M2.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M2.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M2.MotorCtrl_DataCode = 0x000000;

	MotorInit_M1 = 1;	//init wait
	MotorInit_M2 = 1;	//init wait
	MotoCtrl_PackSend12();
	HAL_Delay(MOTOR_INIT_RETRY_MS);

	while ((MotorInit_M1 != 2) | (MotorInit_M2 != 2)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init Wait ");
		HAL_Delay(MOTOR_INIT_RETRY_MS);
		MotoCtrl_PackSend12();
	}

	char str1[16] = { 0 };

	OLED_ShowString(OLED_I2C_ch, OLED_type, 9, 0, "1 2");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init ok! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Y: ");
	itoa(M1_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str1);
	itoa(TA531_RC1.TA531_RC_Y_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str1);

	MotorCtrl_M3.MotorCtrl_HostID = HostID;
	MotorCtrl_M3.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M3.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M3.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M3.MotorCtrl_DataCode = 0x000000;

	MotorInit_M3 = 1;	//init wait
	MotoCtrl_PackSend3();
	HAL_Delay(MOTOR_INIT_RETRY_MS);

	while (MotorInit_M3 != 2) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Init Wait ");
		HAL_Delay(MOTOR_INIT_RETRY_MS);
		MotoCtrl_PackSend3();
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 13, 0, "3 ");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Initialized! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "X: ");
	itoa(M3_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 3, str1);
	itoa(TA531_RC1.TA531_RC_X_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 3, str1);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Check TouchPen! ");
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//F
	HAL_Delay(700);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);	//F
	HAL_Delay(500);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "PuhUp Rst DispXY");
	HAL_Delay(500);

	if (SW_UP == 1)	////reset display xy
			{
		Sys_tune1();
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 2s Reset");
		HAL_Delay(800);
		if (SW_UP == 1)	////reset display xy
				{
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 1s Reset");
			HAL_Delay(800);
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Release & Reset");
			HAL_Delay(2000);

			if (SW_UP == 0)	// into reset display xy
					{
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"U/D/L/R Set X0Y0");
				HAL_Delay(800);
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X0:");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, "Y0:");

				while (SW_BUTTON == 0)	//no push down
				{
					SW_UP_pre = SW_UP;
					SW_DW_pre = SW_DW;
					SW_LEFT_pre = SW_LEFT;
					SW_RIGHT_pre = SW_RIGHT;
					SW_BUTTON_pre = SW_BUTTON;

					SW_UP = (HAL_GPIO_ReadPin(SW_UP_GPIO_Port, SW_UP_Pin) == 0);
					SW_DW = (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin)
							== 0);
					SW_LEFT = (HAL_GPIO_ReadPin(SW_LEFT_GPIO_Port, SW_LEFT_Pin)
							== 0);
					SW_RIGHT = (HAL_GPIO_ReadPin(SW_RIGHT_GPIO_Port,
							SW_RIGHT_Pin) == 0);
					SW_BUTTON = (HAL_GPIO_ReadPin(SW_BUTTON_GPIO_Port,
							SW_BUTTON_Pin) == 0);

						// UP键 - 渐进加速（校准坐标轴互换：控制Y+）
						if (SW_UP == 1) {
						int step;
						if (SW_UP_cnt == 0) {
							step = 1;
						} else if (SW_UP_cnt < 8) {
							step = 5;
						} else if (SW_UP_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
							TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act + step;
							TA531_RC1_fg = 2;
						}

						// DOWN键 - 渐进加速（校准坐标轴互换：控制Y-）
						else if (SW_DW == 1) {
						int step;
						if (SW_DW_cnt == 0) {
							step = 1;
						} else if (SW_DW_cnt < 8) {
							step = 5;
						} else if (SW_DW_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
							TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - step;
							if (TA531_RC1.TA531_RC_Y_trg < 0) {
								TA531_RC1.TA531_RC_Y_trg = 0;
							}
							TA531_RC1_fg = 2;
						}

						// LEFT键 - 渐进加速（校准坐标轴互换：控制X-）
						else if (SW_LEFT == 1) {
						int step;
						if (SW_LEFT_cnt == 0) {
							step = 1;
						} else if (SW_LEFT_cnt < 8) {
							step = 5;
						} else if (SW_LEFT_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
							TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - step;
							if (TA531_RC1.TA531_RC_X_trg < 0) {
								TA531_RC1.TA531_RC_X_trg = 0;
							}
							TA531_RC1_fg = 2;
						}

						// RIGHT键 - 渐进加速（校准坐标轴互换：控制X+）
						else if (SW_RIGHT == 1) {
						int step;
						if (SW_RIGHT_cnt == 0) {
							step = 1;
						} else if (SW_RIGHT_cnt < 8) {
							step = 5;
						} else if (SW_RIGHT_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
							TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + step;
							TA531_RC1_fg = 2;
						}

					MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg,
							TA531_RC1.TA531_RC_Y_trg);
					HAL_Delay(50);

					itoa(TA531_RC1.TA531_RC_X_trg, str1, 10);
					OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 2, str1);
					itoa(TA531_RC1.TA531_RC_Y_trg, str1, 10);
					OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str1);
				}

