YanqiS/stm32temp1/main.c
				SPI_Flash_ReadBytes(temp1, Sys_Addr_DispX1, sizeof(int));
				if ((temp1[0] != ScreenSz_1.DispX1[0])
						|| (temp1[1] != ScreenSz_1.DispX1[1])
						|| (temp1[2] != ScreenSz_1.DispX1[2])
						|| (temp1[3] != ScreenSz_1.DispX1[3])) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash Err!");
					while ((temp1[0] != ScreenSz_1.DispX1[0])
							|| (temp1[1] != ScreenSz_1.DispX1[1])
							|| (temp1[2] != ScreenSz_1.DispX1[2])
							|| (temp1[3] != ScreenSz_1.DispX1[3])) {
						SPI_Flash_WtritEnable();
						HAL_Delay(5);
						SPI_Flash_WriteSomeBytes(ScreenSz_1.DispX1,
						Sys_Addr_DispX1, sizeof(int));
						HAL_Delay(5);
						SPI_Flash_ReadBytes(temp1, Sys_Addr_DispX1,
								sizeof(int));
					}
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash OK!");
				}

				SPI_Flash_ReadBytes(temp1, Sys_Addr_DispY1, sizeof(int));
				if ((temp1[0] != ScreenSz_1.DispY1[0])
						|| (temp1[1] != ScreenSz_1.DispY1[1])
						|| (temp1[2] != ScreenSz_1.DispY1[2])
						|| (temp1[3] != ScreenSz_1.DispY1[3])) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash Err!");
					while ((temp1[0] != ScreenSz_1.DispY1[0])
							|| (temp1[1] != ScreenSz_1.DispY1[1])
							|| (temp1[2] != ScreenSz_1.DispY1[2])
							|| (temp1[3] != ScreenSz_1.DispY1[3])) {
						SPI_Flash_WtritEnable();
						HAL_Delay(5);
						SPI_Flash_WriteSomeBytes(ScreenSz_1.DispY1,
						Sys_Addr_DispY1, sizeof(int));
						HAL_Delay(5);
						SPI_Flash_ReadBytes(temp1, Sys_Addr_DispY1,
								sizeof(int));
					}
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash OK!");
				}


				////push down

				////Display Area reset finish		//DispX0,DispX1,DispY0,DispY1;

				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"Reset XY finish!");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2,
						"                ");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3,
						"                ");

			}	//finish reset display xy
		}	//reset display xy comfirm
	}	//reset display xy comfirm
	else {	//DispX0,DispX1,DispY0,DispY1;

//		SPI_Flash_Start(Flash_SPI);

		HAL_Delay(1);
		SPI_Flash_ReadBytes(ScreenSz_1.DispX0, Sys_Addr_DispX0, sizeof(int));
		SPI_Flash_ReadBytes(ScreenSz_1.DispY0, Sys_Addr_DispY0, sizeof(int));
		SPI_Flash_ReadBytes(ScreenSz_1.DispX1, Sys_Addr_DispX1, sizeof(int));
		SPI_Flash_ReadBytes(ScreenSz_1.DispY1, Sys_Addr_DispY1, sizeof(int));

		ScreenSz_1.DispX0_32b = ScreenSz_1.DispX0[0]
				+ (ScreenSz_1.DispX0[1] << 8) + (ScreenSz_1.DispX0[2] << 16)
				+ (ScreenSz_1.DispX0[3] << 24);
		ScreenSz_1.DispX1_32b = ScreenSz_1.DispX1[0]
				+ (ScreenSz_1.DispX1[1] << 8) + (ScreenSz_1.DispX1[2] << 16)
				+ (ScreenSz_1.DispX1[3] << 24);
		ScreenSz_1.DispY0_32b = ScreenSz_1.DispY0[0]
				+ (ScreenSz_1.DispY0[1] << 8) + (ScreenSz_1.DispY0[2] << 16)
				+ (ScreenSz_1.DispY0[3] << 24);
		ScreenSz_1.DispY1_32b = ScreenSz_1.DispY1[0]
				+ (ScreenSz_1.DispY1[1] << 8) + (ScreenSz_1.DispY1[2] << 16)
				+ (ScreenSz_1.DispY1[3] << 24);

		// ⬅️⬅️⬅️ 添加调试输出 - 显示读取的原始字节
		char str1[16];
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, "Raw Bytes:");

		// 显示X0的4个字节（16进制）
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "X0:");
		itoa(ScreenSz_1.DispX0[0], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 1, str1);
		itoa(ScreenSz_1.DispX0[1], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 5, 1, str1);
		itoa(ScreenSz_1.DispX0[2], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 7, 1, str1);
		itoa(ScreenSz_1.DispX0[3], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 9, 1, str1);

		// 显示X1的4个字节（16进制）
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X1:");
		itoa(ScreenSz_1.DispX1[0], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 2, str1);
		itoa(ScreenSz_1.DispX1[1], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 5, 2, str1);
		itoa(ScreenSz_1.DispX1[2], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 7, 2, str1);
		itoa(ScreenSz_1.DispX1[3], str1, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 9, 2, str1);

		HAL_Delay(2000);  // 等待2秒让你看清

		// 显示转换后的32位值（10进制）
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, "32bit Values:");

		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "X0:");
		itoa(ScreenSz_1.DispX0_32b, str1, 10);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 1, str1);

		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, "X1:");
		itoa(ScreenSz_1.DispX1_32b, str1, 10);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 1, str1);

		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Y0:");
		itoa(ScreenSz_1.DispY0_32b, str1, 10);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 2, str1);

		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, "Y1:");
		itoa(ScreenSz_1.DispY1_32b, str1, 10);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str1);

		HAL_Delay(3000);  // 等待3秒让你看清

		HAL_Delay(10);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Read XY fm Flash");
		HAL_Delay(200);

		if ((ScreenSz_1.DispX0_32b > 0)
				& (ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b)
				& (ScreenSz_1.DispX1_32b < XmaxLimit)
				& (ScreenSz_1.DispY0_32b > 0)
				& (ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b)
				& (ScreenSz_1.DispY1_32b < YmaxLimit)) {
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "XY Check Pass!");
		} else {
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "XY Check Fail!");
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Pls Reboot &");
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Reset XY Area");
			Sys_tune1();

			while (1)
				;
		}
		}	//////finish reset display xy

	// id1=0 且 id2=0：开机照常回零后，进入稳定性测试（X/Y 在 10~300 随机移动）
	if (g_moc_stability_test_mode) {
		ScreenSz_1.DispX0_32b = 10;
		ScreenSz_1.DispY0_32b = 10;
		ScreenSz_1.DispX1_32b = 210;
		ScreenSz_1.DispY1_32b = 300;
		MoC_RunStabilityTestLoop();
		return;
	}

			TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX0_32b;
			TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY0_32b;
		TA531_RC1_fg = 2;
		Motor_Protection_Reset();
		Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
		Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
			if (!MoveToTarget_LikeSetXY(MOVE_WAIT_TIMEOUT_INIT_MS)) {
				return;
			}

