YanqiS/stm32temp1/main.c
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Trg: (");
	itoa(TA531_RC1.TA531_RC_X_trg, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 6, 2, str1);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 2, ", ");
	itoa(TA531_RC1.TA531_RC_Y_trg, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str1);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 15, 2, ")");

	HAL_Delay(1000);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//touch pen push
	HAL_Delay(1000);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);	//touch pen release
	HAL_Delay(200);

		TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX1_32b;
		TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY1_32b;
		TA531_RC1_fg = 2;
		Motor_Protection_Reset();
		Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
		Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
			if (!MoveToTarget_LikeSetXY(MOVE_WAIT_TIMEOUT_INIT_MS)) {
				return;
			}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Trg: (");
	itoa(TA531_RC1.TA531_RC_X_trg, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 6, 2, str1);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 2, ", ");
	itoa(TA531_RC1.TA531_RC_Y_trg, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str1);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 15, 2, ")");

	HAL_Delay(1000);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//touch pen push
	HAL_Delay(1000);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);	//touch pen release
	HAL_Delay(200);

		TA531_RC1_fg = 2;
		TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX0_32b;  // 改为X0
		TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY0_32b;  // 改为Y0
		Motor_Protection_Reset();
		Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
		Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
			if (!MoveToTarget_LikeSetXY(MOVE_WAIT_TIMEOUT_INIT_MS)) {
				return;
			}

	itoa(TA531_RC1.TA531_RC_X_trg, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 6, 2, str1);
	itoa(TA531_RC1.TA531_RC_Y_trg, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str1);

	HAL_Delay(1000);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Act: (");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 3, ", ");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 15, 3, ")");

}

void MotoCtrl_PackSend12() {
	MotrCtrl_1_DATA[0] = (MotorCtrl_M1.MotorCtrl_HostID >> 3) & 0xff;
	MotrCtrl_1_DATA[1] = (MotorCtrl_M1.MotorCtrl_HostID & 0x07) << 5;
	MotrCtrl_1_DATA[2] = ((MotorCtrl_M1.MotorCtrl_FuncType & 0x07) << 5)
			+ (MotorCtrl_M1.MotorCtrl_FuncCode & 0x1f);
	MotrCtrl_1_DATA[3] = MotorCtrl_M1.MotorCtrl_DataCode & 0xff;
	MotrCtrl_1_DATA[4] = (MotorCtrl_M1.MotorCtrl_DataCode >> 8) & 0xff;
	MotrCtrl_1_DATA[5] = (MotorCtrl_M1.MotorCtrl_DataCode >> 16) & 0xff;
	MotrCtrl_1_DATA[6] = (MotorCtrl_M1.MotorCtrl_DataCode >> 24) & 0xff;
	MotrCtrl_1_DATA[7] = MotorCtrl_M1.MotorCtrl_ByteData;

	MotrCtrl_2_DATA[0] = (MotorCtrl_M2.MotorCtrl_HostID >> 3) & 0xff;
	MotrCtrl_2_DATA[1] = (MotorCtrl_M2.MotorCtrl_HostID & 0x07) << 5;
	MotrCtrl_2_DATA[2] = ((MotorCtrl_M2.MotorCtrl_FuncType & 0x07) << 5)
			+ (MotorCtrl_M2.MotorCtrl_FuncCode & 0x1f);
	MotrCtrl_2_DATA[3] = MotorCtrl_M2.MotorCtrl_DataCode & 0xff;
	MotrCtrl_2_DATA[4] = (MotorCtrl_M2.MotorCtrl_DataCode >> 8) & 0xff;
	MotrCtrl_2_DATA[5] = (MotorCtrl_M2.MotorCtrl_DataCode >> 16) & 0xff;
	MotrCtrl_2_DATA[6] = (MotorCtrl_M2.MotorCtrl_DataCode >> 24) & 0xff;
	MotrCtrl_2_DATA[7] = MotorCtrl_M2.MotorCtrl_ByteData;

	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_2_TxHeader,
				MotrCtrl_2_DATA);
	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_1_TxHeader,
				MotrCtrl_1_DATA);
	HAL_Delay(MOTOR_SEND_GAP_MS);
}

//void MotoCtrl_PackSend2()
//{
//    MotrCtrl_2_DATA[0] = (MotorCtrl_M2.MotorCtrl_HostID >>3) & 0xff ;
//    MotrCtrl_2_DATA[1] = (MotorCtrl_M2.MotorCtrl_HostID & 0x07) << 5 ;
//    MotrCtrl_2_DATA[2] = ((MotorCtrl_M2.MotorCtrl_FuncType & 0x07)<< 5) + (MotorCtrl_M2.MotorCtrl_FuncCode & 0x1f) ;
//    MotrCtrl_2_DATA[3] = MotorCtrl_M2.MotorCtrl_DataCode & 0xff ;
//    MotrCtrl_2_DATA[4] = (MotorCtrl_M2.MotorCtrl_DataCode >>8) & 0xff ;
//    MotrCtrl_2_DATA[5] = (MotorCtrl_M2.MotorCtrl_DataCode >>16) & 0xff ;
//    MotrCtrl_2_DATA[6] = (MotorCtrl_M2.MotorCtrl_DataCode >>24) & 0xff ;
//    MotrCtrl_2_DATA[7] = MotorCtrl_M2.MotorCtrl_ByteData;
//
//    HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_2_TxHeader, MotrCtrl_2_DATA);
//}

void MotoCtrl_PackSend3() {
	MotrCtrl_3_DATA[0] = (MotorCtrl_M3.MotorCtrl_HostID >> 3) & 0xff;
	MotrCtrl_3_DATA[1] = (MotorCtrl_M3.MotorCtrl_HostID & 0x07) << 5;
	MotrCtrl_3_DATA[2] = ((MotorCtrl_M3.MotorCtrl_FuncType & 0x07) << 5)
			+ (MotorCtrl_M3.MotorCtrl_FuncCode & 0x1f);
	MotrCtrl_3_DATA[3] = MotorCtrl_M3.MotorCtrl_DataCode & 0xff;
	MotrCtrl_3_DATA[4] = (MotorCtrl_M3.MotorCtrl_DataCode >> 8) & 0xff;
	MotrCtrl_3_DATA[5] = (MotorCtrl_M3.MotorCtrl_DataCode >> 16) & 0xff;
	MotrCtrl_3_DATA[6] = (MotorCtrl_M3.MotorCtrl_DataCode >> 24) & 0xff;
	MotrCtrl_3_DATA[7] = MotorCtrl_M3.MotorCtrl_ByteData;

	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_3_TxHeader,
			MotrCtrl_3_DATA);
	HAL_Delay(MOTOR_SEND_GAP_MS);
}

void MotoCtrl_PackSend4() {

}

void MotoCtrl_PositionLoop(int PositionX_mm, int PositionY_mm) {
	if (PositionX_mm < 0)	//10mm -10 = 0
			{
		PositionX_mm = 0;
	} else if (PositionX_mm > XmaxLimit)	//190mm - 10mm = 180
	{
		PositionX_mm = XmaxLimit;
	}

	if (PositionY_mm < 0)	//10mm
			{
		PositionY_mm = 0;
	} else if (PositionY_mm > YmaxLimit)	//190mm + 10mm
	{
		PositionY_mm = YmaxLimit;
	}

	// M3 控制 X 轴
	MotorCtrl_M3.MotorCtrl_HostID = HostID;
	MotorCtrl_M3.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M3.MotorCtrl_FuncCode = 0x02;
	MotorCtrl_M3.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M3.MotorCtrl_DataCode = -(PositionX_mm + 10) * 160;

	MotoCtrl_PackSend3();

	// M1 & M2 控制 Y 轴
	MotorCtrl_M1.MotorCtrl_HostID = HostID;
	MotorCtrl_M1.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M1.MotorCtrl_FuncCode = 0x02;
	MotorCtrl_M1.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M1.MotorCtrl_DataCode = -(PositionY_mm + 10) * 160;

	MotorCtrl_M2.MotorCtrl_HostID = HostID;
	MotorCtrl_M2.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M2.MotorCtrl_FuncCode = 0x02;
	MotorCtrl_M2.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M2.MotorCtrl_DataCode = -(PositionY_mm + 10) * 160;

