YanqiS/stm32temp1/main.c
	return 0;
}

void Motor_Protection_EmergencyStop(void) {
	Motor_Protection.protection_triggered = 2;
	TA531_RC1_fg = 0;

	char error_msg[20];
	switch (Motor_Protection.error_type) {
	case 1:
		sprintf(error_msg, "ERR:Motor Shake!");
		break;
	case 2:
		sprintf(error_msg, "ERR:Motor Stuck!");
		break;
	case 3:
		sprintf(error_msg, "ERR:Timeout!    ");
		break;
	default:
		sprintf(error_msg, "ERR:Unknown!    ");
		break;
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, error_msg);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Stopping Motor..");

	Sys_tune1();
	HAL_Delay(300);
	Sys_tune1();

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Resetting...    ");
	TA531_RC1.TA531_RC_X_trg = 0;
	TA531_RC1.TA531_RC_Y_trg = 0;
	Motor_Protection_Reset();
	Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
	Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
	(void) WaitMotorToTargetWithProtection(3000, MOTOR_WAIT_POLL_MS, false);

	TA531_RC1.TA531_RC_Reset = 0;
	TA531_RC1.TA531_RC_Z_code = 0;
	TA531_RC1.TA531_RC_X_Mov = 0;
	TA531_RC1.TA531_RC_Y_Mov = 0;
	TA531_Lock = 0;

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "System Ready    ");
	Sys_tune1();

	Motor_Protection_Reset();
	HAL_Delay(1000);
}

/* ====================================== */

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */

void Clamp_Position(int *x, int *y, bool allow_reset) {
	// 如果是复位命令，允许归0
	if (allow_reset && (*x == 0 && *y == 0)) {
		return;
	}

	// 确保范围有效（X0 < X1, Y0 < Y1）
	int x_min =
			(ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int x_max =
			(ScreenSz_1.DispX0_32b > ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int y_min =
			(ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;
	int y_max =
			(ScreenSz_1.DispY0_32b > ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;

	// 限制X坐标
	if (*x < x_min)
		*x = x_min;
	if (*x > x_max)
		*x = x_max;

	// 限制Y坐标
	if (*y < y_min)
		*y = y_min;
	if (*y > y_max)
		*y = y_max;
}

static bool Position_InBounds(int x, int y, bool allow_reset) {
	if (allow_reset && (x == 0) && (y == 0)) {
		return true;
	}

	int x_min =
			(ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int x_max =
			(ScreenSz_1.DispX0_32b > ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int y_min =
			(ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;
	int y_max =
			(ScreenSz_1.DispY0_32b > ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;

	return (x >= x_min) && (x <= x_max) && (y >= y_min) && (y <= y_max);
}

void Door_Control(void) {
	// 声明静态变量保存上次状态（6个门，包括预留）
	static uint8_t door_state_old[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
	uint8_t door_changed = 0;

	// ========== 左前门控制（Y_RELAY_1 / PC2）==========
	if (TA531_Door.Door_FL != door_state_old[0]) {
		door_state_old[0] = TA531_Door.Door_FL;
		door_changed = 1;

		if (TA531_Door.Door_FL == 0) {
			HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 0);
		} else if (TA531_Door.Door_FL == 1) {
			HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 1);
		}
	}

	// ========== 右前门控制（Y_RELAY_2 / PC3）==========
	if (TA531_Door.Door_FR != door_state_old[1]) {
		door_state_old[1] = TA531_Door.Door_FR;
		door_changed = 1;

		if (TA531_Door.Door_FR == 0) {
			HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 0);
		} else if (TA531_Door.Door_FR == 1) {
			HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 1);
		}
	}

	// ========== 左后门控制（Y_RELAY_3 / PA2）==========
	if (TA531_Door.Door_RL != door_state_old[2]) {
		door_state_old[2] = TA531_Door.Door_RL;
		door_changed = 1;

		if (TA531_Door.Door_RL == 0) {
			HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 0);
		} else if (TA531_Door.Door_RL == 1) {
			HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 1);
		}
	}

	// ========== 前引擎盖控制（Y_RELAY_4 / PA3）==========
	if (TA531_Door.Door_Hood != door_state_old[3]) {
		door_state_old[3] = TA531_Door.Door_Hood;
		door_changed = 1;

		if (TA531_Door.Door_Hood == 0) {
			HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 0);
		} else if (TA531_Door.Door_Hood == 1) {
			HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 1);
		}
	}

	// ========== 后备箱控制（Y_RELAY_5 / PB1）==========
	if (TA531_Door.Door_Trunk != door_state_old[4]) {
		door_state_old[4] = TA531_Door.Door_Trunk;
		door_changed = 1;

		if (TA531_Door.Door_Trunk == 0) {
			HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 0);
		} else if (TA531_Door.Door_Trunk == 1) {
			HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 1);
		}
	}

	// ========== Y_RELAY_6 预留占位（PF6）==========
	if (TA531_Door.Door_Reserve != door_state_old[5]) {
		door_state_old[5] = TA531_Door.Door_Reserve;
		door_changed = 1;

		if (TA531_Door.Door_Reserve == 0) {
			HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 0);
		} else if (TA531_Door.Door_Reserve == 1) {
			HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 1);
		}
	}

	// ========== 发送门控制ACK报文到CAN1 ==========
	if (door_changed) {
		TSA_Door_Relay_DATA[0] = 0x1A;
		TSA_Door_Relay_DATA[1] = 0x20;
		TSA_Door_Relay_DATA[2] = 0x42;

		// Byte3: FL, FR, RL, Hood（每个2 bits）
		TSA_Door_Relay_DATA[3] = (TA531_Door.Door_FL & 0x03)
				| ((TA531_Door.Door_FR & 0x03) << 2)
				| ((TA531_Door.Door_RL & 0x03) << 4)
				| ((TA531_Door.Door_Hood & 0x03) << 6);

		// Byte4: Trunk, Reserve（每个2 bits，还有4 bits空闲）
		TSA_Door_Relay_DATA[4] = (TA531_Door.Door_Trunk & 0x03)
				| ((TA531_Door.Door_Reserve & 0x03) << 2);

		TSA_Door_Relay_DATA[5] = 0x00;
		TSA_Door_Relay_DATA[6] = 0x00;
		TSA_Door_Relay_DATA[7] = 0x00;

		// 发送到CAN1
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Door_Relay_Header,
				TSA_Door_Relay_DATA);
	}
}

void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

	char *str1 = "SYS ERROR!";
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str1);

	__disable_irq();
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
